{"podcast_details": {"podcast_title": "The Book Review", "episode_title": "What to Read in August", "episode_image": "https://image.simplecastcdn.com/images/621229bd-2556-4ce6-8ae0-9fa3046f9da9/1e9abcf9-af9c-4105-8b1b-8e05c60c1fcf/3000x3000/8ce0200f165a6c5cafeecc11ac3294f228d9e46d8af6079a5a9db0fe3b62c8fe48ee2dbb6b2460bf705631e82a06b6b79e940141aad774c868833e2a204ce41b.jpeg?aid=rss_feed", "episode_transcript": " This is the Book Review Podcast, and I'm Gilbert Cruz, editor of the New York Times Book Review. Yes, we are part way through August, but we're coming to you nonetheless with a few thoughts on interesting books that are coming out this month. I spoke with Sarah Lyle, a Times writer at large and our Thriller columnist, about the new book Whale Fall, a unique thriller about a teenage scuba diver who gets swallowed by a sperm whale. But first, Jumana Katiib, an editor at the Book Review, gives us a rapid fire look at August books. We'll turn to that conversation now. Jumana, welcome back to the podcast. Thank you for having me on, Gilbert. So you're here to talk about August, you're here to talk about a couple of great books that are coming out this month, and the first one belongs in that great subcategory of grifters, historical grifters? Grifters through time and space, yeah. This is Anansi's Gold by Yipoka Yipu. The author is a freelance journalist and she does a lot of work out of Ghana. And this is the story of a swindler that I had never heard of. He's a Ghanaian con man named John Akable Meza. He had very humble beginnings and managed to become one of the wealthiest men in Africa during his time. And he was shameless in who he went after. He knows politicians, businessmen, widows, literally took a widow's last sense out of her. And he had this kind of shameless pitch that of course now seems too good to be true. But he went after this with such abandon that he was able to really build this life for himself and evade capture. So Jumano, what was the pitch? Well, one of his favorite stories was that he told people that he and Kwame Nkrumah, who was Ghana's president, they were very close. He was one of the president's confidants. And the president on his deathbed told him, I've stored all sorts of gold bars and Swiss accounts and here's where you find them. It was almost like buried treasure. Of course, nothing like this happened. But he was leveraging this into telling people. You're basically going to double your money because I know where all these gold bars are. And when you read it on the page, of course, it sounds so heartbreakingly obvious and transparent. But what makes this so compelling is that you understand the psychology behind this guy. You understand how kind of ruthless and relentless he was in going after people. And truly somebody I had never heard of. And you are kind of astonished by how wide reaching his scheme was in his day. So this is a book that is for someone that likes historical crimes, someone that likes what who is this book for? I always appreciate learning about things that I've never stopped to think about. I never stopped to think who was Ghana's biggest grifter in the 1970s and 80s. Now I can tell you with full confidence who it was. Pressing question. Yes. And listen, grift is just fun to read about, even if I had my hands clamped over my eyes for a big part of it. Your next book is a big novel that is coming out later this year. And I know it's one that you are particularly excited about. We haven't officially reviewed it here at the book review. So this is not the book reviews official opinion. But I know you're big on it. Tell us about The Beasting. Oh, I love The Beasting. This is by Paul Murray, who's an Irish novelist. I think people know him from a previous book called Skippy Dies, which is a send up of boarding school. This is a bit different. This is a family story that's again set in Ireland. The family's in crisis, right? They made their money running a Volkswagen dealership and very quickly became a well to do enviable family. But 2008 rolls around and they're hit by the financial crisis, I think worse than a lot of people too. They're contending with the loss of status, loss of financial security. And then each member of the family, there are four main characters, are wrestling with their own problems, right? So there's Cass, who's about to go to university and then her adolescent brother PJ, who's so sensitive and emotional and can tell that his parents marriage is cracking. So he wants to make himself scarce because he's a very tender character. And then the parents, Dickie and Imelda, who have secrets and histories that you just can't even begin to imagine until you get into their chapters. So Murray gives each character a pretty substantial section of the book. And it's very funny. Everybody's voice is completely memorable. I will also tell you that Imelda's section, which I think is my favorite, it is written in a very associative Molly Bloom style. So if you're a reader who is thinking to yourself, you know, my kingdom for periods at the ends of sentences, this might be a bit of an uphill climb, but it is totally worth it. I'm loving it. It's 650 pages, but it doesn't feel like it. So a 650 page sprawling family epic. Certainly we've never seen one of these before, but it's funny. It's memorable. That was a wonderful non official book review opinion on a book that won't come out for a few weeks. But that is The Beasting by Paul Murray. Yeah, reserve it at the library now. Let's jump back over to nonfiction. Why don't you give us another one? Okay, so going from a family quartet to a group biography of four philosophers. Well from Eilenberger, he's a German philosophy scholar, has something of a following, and he's back with a new book called The Visionaries. This is a group portrait of four female philosophers over a pretty significant decade for all of them, which is 1933 through 1943. So it's Simone de Beauvoir, Ayn Rand, Simone Weil, and Hannah Arendt. And he looks at how each woman had completely different political and moral impetuses, particularly during the war. They each went about it in their own way. They arrived at different conclusions. But I think doing a group biography, which is something he's done in a previous work, actually allows you to see how these philosophical movements, of course, are influenced by who's writing and exchange of ideas. And it doesn't feel hermetic at all. It actually feels completely engaged with the history around them. And if there is kind of a moral center of the book, or if you feel that Eilenberger is aligning himself with one of the philosophers as opposed to the others, it might be Simone Weil, but he balances it all very well. And I think a lot of people loved his earlier book, which was Time of the Magicians, where he focused on some male philosophers. And so this is not quite a sequel, but it's a counterpart to it. And if listeners, you are curious in reading more about The Visionaries, Jen Sali recently reviewed that book for us. You can find that on the website, nytimes.com. Okay, Juman, I feel like we're blazing through these, so let's make it even faster. Tell us about the next book as quickly as you can. Okay, Pet by Catherine Chidji. She is a New Zealand writer. This is perversely great for back to school. It's about a 12 year old. It's 1984 Wellington, New Zealand. Justine has just lost her mother and she's casting about even more so than your typical adolescent. And I think maybe most of us can remember what it's like to be totally enamored or fascinated by that one cool teacher. So of course that happens to Justine. There's Mrs. Price. She's very glamorous. She's very mysterious. Her whole family died in a car accident, which I think makes everybody even more intrigued. And perhaps inevitably Mrs. Price takes Justine under her wing and makes her pet. And there's all sorts of adolescent power structure stuff going on. It reads like a school thriller, right? It's like a pretty, I mean, even for a Catholic school, it is a pretty twisted environment, memorably twisted environment. I went to Catholic school. Oh good, you're going to love this. They're terribly twisted. Yeah, terribly twisted. I'll never go back. Who was your favorite teacher? Oh, well, so now I've found out that some of them listened to this podcast. So, well, I can say my high school French teacher, because her daughter and I are very close friends and I just saw her in Paris two weeks ago. So I think she wins because she bought me a glass of wine. What's the opposite of a humble brag? Oh yeah, this is a problem we're working on. Tell us about the last book on your list, which is called Happiness Falls. Yeah, this is a follow-up novel by Angie Kim, who became something of a sensation with her debut, Miracle Creek. This was a legal thriller. It was a medical story. It followed the aftermath of an experimental medical treatment that went very wrong. It was an oxygen tank that exploded and killed people and injured people. And it focused on an immigrant family and children with special needs. And it really trained an eye on this injured community of people that were hurting. That's what she really seems to drill down into. So this is a different story. This is a story of a disappearance. So again, we have a Korean-American family. One of the children, a teenage boy named Eugene, is nonverbal. He and his father go out for a walk and Eugene comes back, but the father doesn't and the family scrambles to try and figure out what happened to their father. And the only person who really saw what happened is of course this nonverbal teenager. But she makes it very moving. She really focuses on the interiority and the efforts to connect and I think that this will be pretty satisfying for people who liked her first book. Okay, I'm going to butt in before I ask you just to recap all those books for our listeners and just talk about two other books that are coming out in August, one of which listeners of the Book Review Podcast should already know about because it was written by a person I interviewed last week. That was Tom Lake by Ann Patchett. There's also a pretty well-reviewed book by James McBride called The Heaven and Earth Grocery Store. And you, Jumana, have talked about James McBride on this very podcast when you talked about reading his memoir, The Color of Water. But he's also known for a historical novel called The Good Lord Bird, which is about the Civil War era notable figure, John Brown. It was made into a well-received TV series starring Ethan Hawke a few years ago. And then he was on our 10 Best Books of 2020 with his book, De King King Kong. So I think there are a lot of people very excited for The Heaven and Earth Grocery Store. Jumana, I hate to do this, but I'm going to ask you to recap the books that you have talked about for the sake of our listeners. I knew it was coming. So today I talked about Anansi's Gold by Ipoka Ibu. I talked about The Visionaries by Wolfram Islandberger, which was translated by Sean Whiteside. The Beasting by Paul Murray. Pet by Catherine Chidji. And Happiness Falls by Angie Kim. We'll be right back. Welcome back. This is the Book Review Podcast and I'm Gilbert Cruz. Joining me now is Sarah Lyle, who does many things here at The Times, but most relevant to us, she writes our regular thrillers column. She was last here in early June talking about some books she was looking forward to this summer. You should go back and check out that episode if you haven't. Sarah, welcome back. It's so great to be here. This is not related to books, but if you remember the last time I saw you was in a bar after the movie Oppenheimer. We were in the same movie theater. And very briefly, what are your thoughts a month later on the Christopher Nolan film Oppenheimer? Of course, it was exciting to be in a movie theater on a day where every seat was sold out. We were there with all these people. We got great seats. We got to recline. That was really fun. You know, I love going to the movies. I've been haunted by that movie. I think really gets better the more you think about it. I think some of the scenes were so beautifully done. I did what probably you did and went down a bit of a rabbit hole inquiry on the internet, looking up all the characters, checking out to see what was historically accurate, looking forward to reading the book. So I thought it really held up. What about you? I possibly went to see it again. And that's all I'll say about that. Is that because you didn't think you got enough out of it the first time there was stuff you missed? You wanted to see some explosions again? What was your reason? I think there are things that a movie theater can do that even my big screen TV at home cannot. And so I wanted to experience it again on the big screen. But similarly to you, I went on a went down a rabbit hole, read a ton of reviews and historical pieces. And honestly, I feel like after reading the book that we're here to talk about, I also went down a bit of a rabbit hole to figure out like how much of this is possible. Is this real? What are the insides of a whale? The book that we're here to talk about is called Whale Fall. It's by Daniel Krauss. And Daniel Krauss is an author who's operated largely in the horror space. He's worked with Guillermo del Toro. He wrote the novelization to the best picture winning film, The Shape of Water. And his new book is a thriller with some horrific elements. And we are pretty big on it here at the book review. So tell us the basic premise of what the book is about. It is pretty wild. And then we can go into a little detail. That's the thing. OK, so when I was assigned this book, I was pretty skeptical. It didn't sound like my kind of book. But of course, I'm a happy employee who would like to do what I was asked to do. Thank you. So it's about a guy who gets swallowed by a whale. OK, we're done. Good. Great. Great pod. End of Genesis right there. So it's about a 17-year-old tortured adolescent, the way many 17-year-old boys are, whose father has recently died and who was estranged from his father during that period. And so to redeem himself decides he will go back off the coast of Monterey, California, where they live, and try and recover his father's bones from the bottom of the sea. His father drowned himself suffering from terminal cancer and decided to kill himself rather than just waiting to die. And he was a renowned, esteemed diver in the Monterey Bay diving community, but was also an alcoholic, was quite verbally abusive, was very unhappy as he got older. And he and his son had really become totally estranged. So their son feels super guilty. He decides to go get the bones back, and that way he'll redeem himself with his family and feel better about himself. And he sets off with his diving gear on and all of a sudden realizes that he has run into not just a giant squid, and it's quite unusual to see a giant squid so near the surface, but there's a good explanation in the book. And all of a sudden, the two of them are being slurped up by a massive sperm whale. And he has an hour's worth of air in his tank. He's only an hour to get out. And the rest of the book is his efforts to escape from his watery prison or his effluvial prison, whatever. There's a lot of viscera and gore and gunk and gelatinous things in this book. And he's in like a gelatinous sea of crud. And the question is, can he get out? OK, I have a lot of questions. We're not going to ruin the book. That's the basic premise. The cover of the book is a guy about to go into a whale's mouth, so we haven't ruined anything. But that's like the first five minutes of the book. I want to ask you, as someone who maybe is not a fan of gunk or gelatinous prose, what was it like reading this book? It's pretty gnarly. It is pretty gross because as far as I could tell, the descriptions of the inside of a whale are accurate or at least accurate seeming. So what's it like to read about this guy going through multiple stomachs? It's so beautifully written, this book. It's so exciting. Propulsive is a cliche thriller word that I try to stay away from, but it was propulsive. I couldn't stop reading. I could barely turn off the lights to go to sleep. I think I woke up early and finished it the next day. Because not only is it beautifully written and the descriptions of the underwater stuff are so gorgeous, but you really start caring about the character. And the chapters, I should have said, are half of them take place in immediate time where he has this much time to get out of the whale and escape. And the other half are him reliving his relationship with his father. And you hear about his background. You hear about who his father was, who the family was, why they became estranged from each other. And so his father starts to become much more of a three dimensional character than he originally was and starts to become quite a fascinating character himself. Books that might be similar that people might have read would be The Martian. And of course, these were both movies too. 127 Hours was a movie. And those are both escape science fiction or escape adventure things where you have a terrible problem. You got to get off a planet or you have to escape from being impaled by a boulder in the West while you're hiking. And you have to use your scientific knowledge and your understanding of survival to get yourself out of the predicament. So there's part of that element here. But it's told in such a... He's in crisis the entire time. He has no moments to sit down and think it through. So the way he's trying to get out of it in his head is to think about the lessons he's learned from his father, what his father has taught him about the undersea world, what he knows about whales, what he knows about the ocean in general, what he knows about diving. And it's this sort of combination of those two things is really irresistible. So what is your relationship to the ocean? My relationship? Yes. Well, I like a whale. You know, whales are also really great. So I started... His understanding of the whale is so beautiful. Actually this whale he's in is a sperm whale. He weighs like 40 tons. He is a majestic, wonderful creature. And from inside his vantage point of one or another of the four stomachs... And the truth is if you get to the third stomach, you're really screwed because it's full of, I think, methane, something awful that'll eat you alive. It's like acid and gross. So he almost goes down and has to get right back out. But from within, he knows what's going on with the whale. And he's scared, for example, if the whale dives too deep, he will immediately die of whatever that thing that happens to you when you're a diver and you go too far down. Thrombosis of the bends? You have thrombosis of the lungs. This is science. We know what we're talking about. At one point, he starts realizing that the whale is being attacked. And the only thing that would attack a whale, as I guess, besides the man, is an orca. So the whale is being attacked by orcas. And all of a sudden, he realizes that a whole bunch of other whales have arrived and they're doing this amazing thing. They get into something called a marguerite formation, which is like a rosette sort of formation, where they all form a circle around the wounded whale in the middle to fend off the orcas. And the description of how this works is really exciting. And you're like, I go whale. You know, and he starts to feel as one with this whale. Like he really respects and sympathizes and loves the whale. And there's a lot of probably the only thing I would say about the book that maybe was a little much for me was that there's a bit of heavy handed psychology with the whale and the dad. I think it worked fine. But it was a little much at times. So one of the things that to me, at least made the book as propulsive as it was, is something that you see in thrillers sometimes, which is short chapters. These are chapters that are two, three pages. The ones that are set in the present show at the top of the chapter, essentially how much air he has left in his tank. There's also the way that the book is structured just makes you want to keep going through it as fast as you can. I don't like short chapters. I find it annoying. And I like a long paragraph. And I also don't like the paragraphs that are like two words long with a period with no verb that irritates me. But in this I'll I let it go. I thought this was absolutely fine the way it worked. The book won you over. The book won me over. Can I read the part where I started really loving it? Absolutely. Okay. So this is in my review and this is a description of a moment in the book where before he's being swallowed by anything and he's still swimming around, he's about to try to find the bones and he sees what looks like a bunch of stars in the water. And this is Daniel Krauss. Stars churn like ocean tides spread thin in cosmic dust, iris tight into blinding kzars. One wheel of stars flattens into the shape of a lash. A second wheel does the same. A third, a fourth, every star cluster now an interstellar highway. And then he says, oh my God, these are the bioluminescent lights of Arceus, which happens to be a giant squid. And then he describes the squid. Arceus is 30 some feet long from mantle fins to tentacle toes. Half a ton of gloppy flesh floating in place, spreading like oil. It's natural lights like glinting eclipses of a thousand moons. That's just so beautiful. It's like poetry. I wouldn't have thought to put those words together in that way. They don't even sound like a sentence necessarily, but how wonderful. And there's a lot of scripture like that. There's a jellyfish that finds its way into the meal as well at some point. And it's so beautiful the way he talks about the jellyfish. It's great. What is your favorite whale? I like this whale. So I did a little whale research and, you know, I was looking up Jonas and did you know, maybe you did, maybe you were raised as a religious person that Jonah was not swallowed by a whale. He was swallowed by a quote giant fish and they never explained what it was. Everyone assumes it was a whale, but who knows? And then what Jonah does is he just sits there for three days till the fish vomits him up, which I'd like to say, having read this, I don't think is realistic. But it's a good lesson in patience. I think people, maybe they conflate Jonah and Pinocchio. They do. They do conflate those two things. A good point. But I feel like in both those cases, being swallowed by a whale is like waiting in like the lounge at Penn Station for your train to come. There's nothing. A terrible experience? No, you're just like in a vast cavernous thing. I guess in my telling the waiting room would be empty. You're in an empty waiting room at the train station. And then when the whale feels like it, he's just like, get out of here. Yeah. Which is not the experience of the character in this book. He's surrounded by wet, loopy things. Effluvia. Effluvia. And viscera. Yeah. And he's got all those gross words that are so gross that he's he's sopping and all that stuff all the time. OK, so I'm going to tell you this great thing. So I did something which you shouldn't do when you write for the paper, which is to read the comments next to your piece. There's a few little comments next to my review. And some of them are like, you're right. I don't like viscera. But maybe I'll try your book, this book that you're reviewing, whatever. And there's one letter from someone who said, I have not read this book, but I myself am a scuba diver. This sounds completely preposterous. No sperm whale would ever come this close to the shore, close to the surface. There's a little thing beneath it from DK from Chicago. OK. DK from Chicago turns out to be Daniel Krauss, the author of the book. Oh, my God. He said I looked at it like, oh, my God, he's going to take issue with the review. Also, he says, as the author, I can guarantee you I wrote the book in close consultation with several professional divers. It all adds up. I don't know which is worse to me, the author of the book reading comments about the review on his book or the reviewer of the book reading comments from scuba diver reply guys. But I probably wouldn't do either of those things. It's a bad idea. But sometimes you get some crazy weird stuff. And it's really it's quite fun. Sarah, you're one of people the book review who are particularly excited about Whale Fall by Daniel Krauss. You wrote a beautiful review of it. So thank you for coming on the podcast to talk about it. Thank you for letting me talk about it with you. That was really fun. If fluvia the word of the day, fluvia or phlegm, phlegm is another awful word that G is hidden under there like a sort of onomatopoeic silent G. Now you're grossing me out. You're grossing me out. If fluvia was on the edge. But yeah, viscera. How do you feel about viscera? I love this. You love a viscera. I love I can just talk about viscera all day. Those are my conversations with Jumanak Katiib about several notable books coming out this month and Sarah Lyle on the new thriller Whale Fall. I'm Gilbert Krauss, editor of the New York Times Book Review. Thanks for listening."}, "podcast_summary": "In this episode of the Book Review Podcast, Gilbert Cruz, editor of the New York Times Book Review, discusses interesting books coming out in the month of August. Jumana Katiib, an editor at the Book Review, shares rapid fire reviews of a few August books, including \"Anansi's Gold\" by Yapoka Yipu, a thrilling story about a Ghanaian con man, and \"The Beasting\" by Paul Murray, a family story set in Ireland. Sarah Lyle, a Times writer at large and thriller columnist, joins the podcast to discuss \"Whale Fall\" by Daniel Krauss, a gripping thriller about a teenage scuba diver who gets swallowed by a sperm whale. The book is lauded for its propulsive writing and vivid descriptions of the ocean.", "podcast_guest": "Could not find detailed information about Sarah Lyle on Wikipedia. However, you can learn more about the guest here: https://www.instagram.com/sarahlouiselyle/", "podcast_highlights": "The hot topics from the transcript include:\n\n1. The book \"Whale Fall\" by Daniel Krauss, which is a unique thriller about a teenage scuba diver who gets swallowed by a sperm whale. The book received positive reviews and was praised for its propulsive storytelling and beautiful writing.\n\n2. The book \"Anansi's Gold\" by Yipoka Yipu, which is a historical grifter thriller about a Ghanaian con man named John Akable Meza. The book explores his rise to wealth and his shameless schemes.\n\n3. The book \"The Beasting\" by Paul Murray, which is a family story set in Ireland. It follows a family in crisis after the 2008 financial crisis and explores the individual struggles of each family member.\n\n4. The book \"The Visionaries\" by Wolfram Eilenberger, which is a group biography of four female philosophers: Simone de Beauvoir, Ayn Rand, Simone Weil, and Hannah Arendt. The book examines their different political and moral perspectives during the years 1933 to 1943.\n\n5. The book \"Pet\" by Catherine Chidji, which is a coming-of-age story set in 1984 Wellington, New Zealand. It follows a 12-year-old girl named Justine who forms a bond with her mysterious and glamorous teacher, Mrs. Price.\n\n6. The book \"Happiness Falls\" by Angie Kim, which is a follow-up novel to her debut, \"Miracle Creek\". It is a suspenseful story about a Korean-American family dealing with the disappearance of their father.\n\nThese topics could create discussions around themes such as survival, family dynamics, historical grifters, philosophical movements, and coming-of-age experiences."}