{"podcast_details": {"podcast_title": "Cloud Talk", "episode_title": "Episode 144: Changes in the Cloud Market and AI Impact", "episode_image": "https://assets.fireside.fm/file/fireside-images/podcasts/images/3/3829bc66-3742-4475-a2c1-a30cf419eac6/cover.jpg", "episode_transcript": " Welcome to Cloud Talk Live. I'm your host, Jeff Deverter. Now here at Cloud Talk, we strive to help decode the ever-changing world of technology, to help you apply it to your business, so that hopefully you'll have one more tool in your arsenal to help you improve your business and those around you. Now this recording is from our Cloud Talk Live event, which happens almost every Tuesday and Thursday at 8.30 a.m. Central Time on the Rackspace LinkedIn, YouTube, and Twitter accounts. Be sure to come and watch us there. And join the conversation live with us in real time. Your participation helps drive the conversation. Now, let's get on with today's show. That's right, everyone. Welcome back to another Tuesday. I'm Jeff Deverter, Chief Technology Evangelist for us here at Rackspace Technology. Now, as you know, the same old rules apply. I'd love for you to introduce yourself. Tell me who you are. Tell me where you are in the comments. I'm not sure if you're watching on YouTube, if you're on LinkedIn, or what platform you're on, but I would love for you to introduce yourself. Be a part of this conversation. In fact, if you do, then we've got some new tools over here. I may try to actually respond to you in text form live. We'll see if it works, though. And then if you want to get a hold of us to talk about anything, you want to give us a little feedback, you've got an idea for a show. Well, I'll tell you what. Just send us an email over at solve at Rackspace.com. I would love to get your email. I've gotten a few over the over the months and years that we've done this. Got to tell you, not a whole lot, but I would love for you to do it. All right. Looks like we are getting some responses. Let's let's push this button right here. You ready for it here? We're going to push in a button. Boom. Now you can see my chat. And I'm going to write good morning all. Let's see. Hopefully that's all streaming through. It might even show up as me. Now it just shows up as a restream. That's the tool we use around here. It's called Restream.io. If you're ever looking for a streaming technology. So check that out, everyone. Keep your your comments coming in. Syracuse, New York, Brent. Did you know I grew up in Socrates, New York? Granted, not very close, but still part of the same state. So everyone, welcome up. Steve from San Antonio is here. We have Fort Myers, Florida in the house. Who else do we have? Maryland is here. Huge show from the US, which I love. Thanks, Daniel, for bringing that up here as well. Qatar is here. Thank you so much for being here, part of the show. Guys, it's going to be a really interesting one. But before we get into all of those details, let's look at what else is happening around the program. So I would love for you if you're not already subscribed to the podcast. Now, the podcast, you say, Jeff, what's the difference between the live stream and the podcast? Well, I'll tell you, there's two things. First of all, all of the audio from these events shows up down there in the in the podcast. So if you miss an episode, you can still get all of the content. But also we produce unique and original content for the podcast only. So the only way to get that, of course, is to subscribe or to set alarms to go look if there's a new episode. No one wants to do that. In fact, the current episode that's out there, if you want to go check it out, it was from earlier this year. I had our CTO, Srinu Kaushik was on and we talked all about sustainability. It was the Earth Day episode. So I'd love for you to go check that out as well. Who else? We've got Boston here. Toronto is here. We have Ohio. I hear it's cooler in Ohio. My wife is a good friend up there. They've been chatting. India is here. Fantastic. Look at all these these folks in the room. Huse Michael from Houston. Michael, I'm sending you a CloudTalk t-shirt. Oh, if I had one, I'd send it to you. Everyone, I also want to call out what's new over in Solve. In fact, Daniel's going to bring up a little QR code. But if you've heard of the phrase or the word co-pilot, well, it has to do, of course, with AI. Specifically, Microsoft is utilizing it. And you'll find it elsewhere in the ecosystem as well. But ultimately, what we're talking about here is how we take AI and we use it to help us get our job done. Now, Microsoft has baked their AI technology, the chat GPT and whatever version it is in. And sorry, I got distracted by somebody talking about SpaceX in the chat. That's really cool. So, Macy, thank you for that. Engine SpaceX gets love. That's so cool. Why can you hear those engines, Macy? I have to know. So, let me know. Oh, all right. Pennsylvania. All right. So, we're talking about Jeff Hacks here. Very all over the factory place today, here today. So, New York. Grew up in upstate New York, but was born southeastern Pennsylvania. I can see Pennsylvania is in the house. Brian, thank you for being here. All right. So, back to co-pilots, everybody. Go check out this article. The QR codes there on the screen. Love for you to go check it out. It has to do with co-pilots. In how in the use in AI, Microsoft, I was mentioning how that's getting baked into everything that they do that it can help you get your job done better, faster, easier. So, go check it out. All right. With that, everyone, let's get into the conversation. Now, I spent last week, a good part of last week up in Dallas, at an event with one of our most cherished partners, Teleris. And Teleris did their annual summit up in the Dallas area in McKinney. Now, McKinney, where was it? Somewhere up in Dallas. Dallas is big. And it was a great event. They have some amazing speakers. I got to get up and talk on stage at one point with my now good friend, Kobe Phillips. So, you can go check them out. There he is. There's his picture. Not... I said his name wrong when we got on stage. And it became a whole joke. So, let's get Kobe up here and we'll get into our event. So, Kobe, welcome to the program. Hello. Good to be here. Glad to be. Glad to have you here. So, and also, thanks for getting up early. You're a West coaster. In fact, we pushed our time back just a little to make it somewhat more palatable for you. I very much appreciate that. Yes. So, I'm not much of a morning person. So, we'll see how good I do today. There you go. So, hey, you're off to a great start. You know, you haven't said my name wrong and I said your name wrong on stage. Wasn't that fun? Yeah. I just... I'm going to give a quick background of that story. Right before we kicked off, we were co-presenting. And Jeff goes... I double-checked the pronunciation of his last name. And he goes, man, it'd be hilarious if you're like, oh, my good friend Jeff then said my name wrong. And not less than 30 seconds later, he goes... 30 seconds later, I'm saying, hey, Corey, nice to see you. Corey, great to be here. So, we were able to make it a joke. And I think I did that to you, though. I think I put it into your head. It was... And I tried to get it for failure. So, my apologies. It's something like that. Yeah. I'll just blame you. I like that better. That's awesome. If you can't tell from the West Coast, I just made that whole thing that you did wrong my fault. So, the passive aggressiveness really comes along. That's really good. That's really good. I love it. Thank you so much for that. Hey, so Casey... I said, Casey, where did she go? Where did she go? She just said she's down on Padre Island and they test the SpaceX rockets and she can hear it across the bay. How cool is that? SpaceX. Well, being in Seattle, I go by the buildings quite often. Do you really? Yeah. That's pretty cool. All right. So, hey, Todd Catlett's watching us this morning. We know Todd. Todd, welcome to the program. So, Todd is very familiar with what a technology... TSD, Technology Solution Distributive. That's what Teleris is, correct? That is correct. What is that? The whole world does not know. In fact, it took me a little while to figure it out. It's an interesting spot in the technology ecosystem. We essentially support a ton of different style of consultants. It can be independent brokers all the way through disties and all the companies that everybody's familiar with from logos standpoints. Everybody is starting to really push into this reoccurring revenue model. And that's the space we've been playing in for about 20 years. And we started off as a really traditional telco place, right? You're now Lumen, Comcast, et cetera. So, we have partners that came out of that space selling circuits. But what we've seen over the last five to seven years is this evolution of technology that's available on our space, therefore attracting new people to it. We're in the thousands of independent brokers. And I call them independent brokers. And again, they can be companies, they can be hundreds of people or a single individual. And essentially what we do is we represent about 400 suppliers, Rackspace being one of our crown jewels in the cloud and security. Thank you. And what that does is it gives them access to it. Now, the interesting part is we don't paper anything. We simply put everything together. We gather a monthly commission. And then majority of that goes through to the independent broker. But we put up a lot of resources to help support that. So on our staff, we have 20 engineers, right? Wow. We've got a 350, 400 person company. We have 20 engineers and we're growing that space. Out of those engineers, the expertise level is pretty dense. We have four CISSP on staff. And all of these resources are just available for our partners to be able to come in and utilize that are customer facing. So it's a consultancy shop that also helps distribute. It's a little bit of everything for the technology community. And like I said, it's one place that we can see everything in a customer's environment from a cable circuit all the way through a Kubernetes environment. So and everything in between. So it's a really unique spot, but it's growing like crazy. This episode of Cloud Talk is sponsored by Cisco AppDynamics. Technical environments are getting more complex and Cisco AppDynamics is helping to cut through the noise. Their full stack observability solutions help make every tech decision a business decision and keep everyone all on the same page. AppDynamics software enables deeper understanding of both user and application behavior so that your teams can see, share, and take action all in real time. Just go to AppDynamics.com to learn more, schedule a live demo, or even start a 15-day free trial to see the difference for yourself that Cisco AppDynamics can make in your mission-critical applications. All right, with that, let's get back to the program. Yeah, that's really interesting, you know, because a lot of folks, as I look at the demographics of the folks who will watch this program, you know, we have, from a geographical point of view, tons in the Texas area, of course, we're central to that, we have lots in Europe, but then a huge group that show up from India, we have great showing in India, but as I look at the types of people who are coming in, they tend to be, by and large, we will see a significant population who are sales folks or out there, you know, you talk about them as being, you know, the folks that you're working with, I mean, it's people who have relationships out there who are representing technology that they are brokering in some form or fashion. In the old days, your business, your world tended to be focused more on the connectivity side, circuits, things of that nature. And we were talking before we went live here about how your big summits tended to have some information, but then some community building events, mountain biking, you know, you went to the malls, all kinds of crazy stuff. But all of that's been cut out, generally speaking, at the broker's bequest to get more education because the market is maturing and getting more, there's more and more things that people can do and more that they can represent. So I think that's very well illustrated by the fact that, I mean, you mentioned what, 20 some engineers and the like who work with you and your team to help, you know, design to architect some of these solutions and connect suppliers, people like a rack space to the brokers. Yeah, if you look at the broader community, right? So we have our engineers that are connecting into then, say the rack space and all of your engineers and the ability for our brokers, our partners to problem solve for their customers is at an all time high. And they want to understand everything that's available for them. And so you see the sophistication level start to rise as the channel's grown and you start to see the production. One of the things that I love about our channels, we produce more new logos for our suppliers than any other means, most of them, right? So going back to those relationships, you have customers now with resource drain being an issue, like just can't find the, they're going out to our teams, our partners and saying, help me find resources and solutions for things far more than they ever have. And then they're stretching into, you know, what can we solve for everybody? So it's a really great community. It's like I said, it's growing and we're, as we offer more technology, we see more and more sophisticated products come to bear for their customers. And it's a lot of fun to work on. Yeah. So speaking of sophisticated products, what are you, what are some of the things that you're seeing requests for that maybe you didn't see this time last year? A lot of containers still containerization still as what you start to see in our channel is as we're not what I would call a bleeding as champ, right? We're not going to be on the front of technology, but as that technology starts to be more and more sophisticated, that technology starts to be more and more consumer based. You see this apex of like where we meet as the demand comes up, as the customers catch up to that learning curve themselves, that's where we start to see an impact. So if it comes out, my golden rule is if we see something hit about 18 to 24 months later, it's going to start to really make a headway into our channel with our partners and their customers in conversation. So we're seeing a lot around Kubernetes as a service becoming more and more paramount for customers, a part of a bigger modernization product. That's really what we're seeing. The inside of it all looks a little different per customer as I'm sure everybody's aware, but it's, hey, we made our migrations, but we're not where we need to be. What else can we do? What can we do better? How can we be more efficient? And we're having a lot of those conversations with customers. That's interesting because it tracks very much with the technology adoption curve. You know, if you think about the bell, the new bleeding edge stuff comes out. Just a few people are really making some headlines with it. They're doing some things with it, but it does take that 18 months or so for things to really start to move at a more significant level. Make sure that when there's no issues, there's no technical issues, security. Of course, there's always security issues with everything in the cyber world. But what I think is interesting is now there's some proven use cases that somebody can say, ah, you're fancy Kubernetes stuff. Now I can see how that's going to save me money, make me money, make me more efficient as an organization. How do I actually adopt that? Yeah, there's a couple of things to that, right? What do you do when you're on the bleeding edge? You bleed. And whenever your relationship based organization and that's, that's your brick and mortar is the relationship you have. You can't risk that with the technology that could be detrimental to a company. So it's really a, again, it's, it's a monitoring. This is ready for, for mass consumption type of environment. And we see a lot of success once we get to that point. Yeah. Hey, we saw, I asked a really interesting question and he's talking about, you know, we've seen a bunch of layoffs, what out in the general world, you know, what can the job market for cloud technologies, what does it look like these days? So, you know, I think that's a really good one for you, core, Kobe, not Corey, Kobe, because you're out there in the middle of it. See now just stuck in my head. We'll give you three. So I'm moving. There's two. There's two. I would say we're seeing, so that is where a lot of our success is coming. Cause what ends up happening, it's not so much the layoffs that I've been seeing that, that it's actually the opposite. It's not being able to have the right resources. And in that small enterprise, mid market, and particularly we're seeing more and more companies turn to, you know, MSPs and CSPs to come in and do a lot of things for them that they were doing in house. Right. And it's, it becomes a staffing issue. You start to see an arms race from the big three, AWS, Microsoft and Google. And they are, you know, there's their salaries have increased for a lot of key engineers and things like that. And so there's a stat floating in my head right now. And I can't remember who to attribute to it. It's like a well, $1.3 trillion more being spent in an MSP environment, third parties than in last year for IT is the expectation of the outsourcing. And again, it's companies that are recognizing the difference between managing in-house teams and managing to contracts with suppliers. Right. And there's a different skillset there, but as you, you know, as you come through and you're able to really hone in on that, it can be much more effective or proven argumentatively, much more effective to bring in a supplier and manage that way. So we're seeing, we're seeing an increase in what we do, like, you know, with companies like Rackspace, like companies are now turning to you guys, I would assume more Jeff, and you can answer this help us more than you ever have because stuff that we used to do in-house, we don't, we don't have the ability to staff anymore for one reason or another. Are you seeing? Right. Yeah, we're seeing, we're seeing it driven through two, through two primary things. The first is they're wanting to do more with what they already have there and they're trying to be more efficient with it. So, you know, they're looking for ways to augment the capabilities they already have. But then second to it is with all the new technologies that are coming out and that specific, I'll call out AI, which we can get into a little bit. I know that's part of the topic of the day. You know, there are technologies that companies want to adopt that they just don't have the people for. And in some cases, it's not proven for them. In other words, they haven't, they haven't been able to prove it for themselves. So they're not ready to go invest in, you know, a couple dozen data scientists and the folks that it takes to make some of this stuff happen. So they're looking for, you know, supplier companies, partner companies like Rackspace to be able to come in and do that work for them. So, so are you seeing many requests these days when we think about AI and what does that look like on your side? So we are. So I have a counterpart that handles our customer experience. Right. So I'm our VP of cloud management services here. We have a CX team and Shane Speakman and Samantha Nelson that kind of collaborate, no pun intended, because of the collaboration side of that. But what they're seeing is that's really where we're seeing it happen, kind of in that that contact center, call center space, how it's affecting your agents and how it's helping replace some of those, you know, areas of, I mean, the stack of employees that are a little bit on the lower end where it's helping automate a lot of that. Right. And we're seeing a ton of AI hit that. And what we'll start to see it do is, you know, I believe AI is going to start to trickle into a lot of those lower areas where it's taking some of the mundane task off of the human element and taking it over and doing it through AI. Right. And then as we trust the technology more, it'll start to move up stack and start to do some, some interesting things. And then it, then it, but I'm thinking we're a few, a few years out on that. But it's getting the drop factor of utilizing the technology is there now, right? We've all seen examples of it, but it's like, well, do I trust it to do and run what all of these things are? But so we're seeing the biggest impact to go back to your question really happened in that customer experience profile. Right. We are seeing more and more conversations around improving data lake analytics and, and getting all of that kind of stuff to a piece to where it's informational to be used, but we're, we're just on the, the tipping point of that. Right. And I think, you know, when you think about utilizing it initially in a, in a CX, a customer experience environment, you know, if we extrapolate that a little couple of clicks further, then, then what that really means is in those tools that are strong in customer experience, they are utilizing AI to help make that a stronger, more better to use proper English experience. And, and I think that that speaks to a common path. When we look at ways with people who are maybe leaving their data center with air quotes, uh, for some of their applications, thinking about how to move them to cloud, our first recommendation generally is, is to think about a SAS based offering when making that type of, of a move, you know, cause if, if SAS can handle the application and the infrastructure and the management and the bandwidth of all of that stuff, well, God bless them, let them do it. Uh, but if your applications require more, uh, more customization, then that's when we have to get into the nuts and bolts. So when we think about AI, CX is a great place for that. The copilot article I mentioned earlier, copilot technologies like for Microsoft is a great way to do it in and around the work you're already doing. How do you work more efficiently? Because that gets back to what I before, and what I think drives a lot of cases, those, the technology adoption curve, think about the bell shape and it gets back to tangible examples, either seeing other people do it or utilizing it in other ways and safe in small ways inside of your organization. And then that lights off some light bulbs. Hey, if I can ask, you know, my co, my, my copilot Clippy inside of word to actually now write my paragraph for me based on a few bullets. Oh, why couldn't I do that against my, my ask questions of my sales data? Why couldn't they ask questions about my partner contracts, customer contracts, things like that? And, uh, and so that's when you start to see real tangible custom use cases for AI starting to show up. Now I do want to call out really quick. Where did it go to ruin? I'm saying your name, right? Um, uh, Daniel, if we could bring his, his comment, he says, how are we tracking the issues with bias and security and even, even questions about the models, these are real concerns. In fact, we've set up a model inside of our own offering here at rack space around, we call it responsible AI, but everything that we're doing that responsible AI drives back to three primary, um, uh, core tenants. And that is, it needs to be sustainable, needs to be, um, uh, secure. It needs to be symbiotic. We're not symbiotic, meaning we're not looking to replace people. We're looking to, how do we make people stronger, better, faster at what they do? Yeah. And I think what, what I love about the introduction of any really cool new technology, right? This, and you go through, I feel like these are the stages of, of how this rolls out. Somebody creates something, we look at it and we go, that's really cool. Then we sit on that for a hot second. And then we start to go, well, what's, what can we use it for? How can it, how can we go from this looks cool to it's can, can be productive and efficient or make it's better. And then we go, how do we tear it apart from every angle? Meaning what are the security risk? What are the things that it could lead to? And I think that's where a lot of us are at with AI right now is that tearing it apart in a good way. And I think these are all responsible ways to look at it. Um, from a security thing, one of the big, the biggest things I was watching a different panel and they were talking about AI and security, right? And they said, well, what are the biggest security risk of AI? And they're like, well, that, that we depend on AI to then combat or to police AI. That's the biggest risk. So like, that's the big, one of the biggest areas is you start to see AI and the, and what it's doing in cybersecurity and things like that. But then you got to look and go, well, who's watching the AI and all that. So I believe there's for like every other part of technology, this will end up replacing some, some, some jobs, right? Yes. Yes. And things while creating new jobs, because I've been working on it for a long time, a long time, and I've been doing it for a long time. And I think it's a, it's a big, big difference because I have specialization and understanding it and working it now. Um, it might be a five to one differentiator, but it's still going to create something out of it because they're still going to have to be that element of somebody to watch what's going on. All right. One more quick break from the program. Now, if you've been keeping up with the news this year, you've been doing great. You can achieve AI success through our transformative process of ID8, innovate, and industrialize. Get ready to revolutionize your business with FAIR, the Foundry for AI by Rackspace. At FAIR, we're on a mission to accelerate the secure, responsible, and sustainable adoption of generative AI solutions across all industries. In the next few weeks, our ID8 workshop will empower you to harness the raw power of generative AI. Imagine skyrocketing productivity, driving efficiency, and reimagining business models. This is your chance to take the first step in exploring the untapped potential of generative AI for your organization. In these sessions, our team of experts will meticulously evaluate the intended and unintended consequences of integrating generative AI into your operations, will ensure that your data quality and integrity are top-notch, and will guide you in embedding your company values, fairness, and ethics into your generative AI governance and operations. Through a series of short sprints, we'll identify the most relevant and impactful generative AI solutions tailored specifically for your business. By the end of the sessions, you'll have a crystal clear understanding of how generative AI can revolutionize your organization and how your business goals can be supercharged by AI. So what are you waiting for? Visit us at FAIR.RACKSPACE.COM to learn more and secure your spot in our generative AI ideation workshop. FAIR, driving innovation, excellence, and unparalleled success in the thrilling world of generative AI. Unfortunately, one of the comments in here, I can't see who actually said it, but he says, I think it's also impacted by partner relationships. There's still gaps in knowledge with MSPs. To support partners, it's a risk of using an inexperienced MSP. And that drives me towards a question. Oh, it's from Angel. Thank you, Megan. Producer Megan, in the chat, private chat. That's right. Further to the rescue. So, Koby, but that brings up the question. You oversee, you're VP of all the cloud things. All the engineers fall into that. And these are the engineers who are helping to not only architect solutions, but as these column partners call in with, I've got this opportunity. I'm trying to figure it out. What's the right solution? What's the right supplier? Supplier meaning the technology MSP. How do you guys, and this isn't, I'm not baiting how you say nice things to Rackspace, but how do you go about choosing a supplier you think is going to be able to best serve that need? We developed, and luckily the engineers are not reporting to me. We have a great leader in our engineering department, Josh LaPresto. So lucky for those guys that are- Good follow-up to Josh. That's right. I have the best job ever. VP with no actual direct reports. So I love, yep, exactly. But to go back to answer the question is we do what we call conceptual architecture. So we set down and we go into an environment with a customer and the nice part about having all of the relationships we have, it's a clear whiteboard. Meaning we don't have an edict to go and sell a product that's within our portfolio because every product is within our portfolio. We have access to everything. So we start with solving the customer's needs and really it starts with that business conversation that drives them to go, what are you looking to do? And then we start to put the technology into it. And by the time that we're done, it really starts to get so dialed in that we go, this is a great fit for X, right? And if this area, then there might be two or three. And we present their opportunity to both. We go through the proper channels of deal registration, so on and so forth. And then we have a deep dive conversation. So by that point in time, we're so far ahead of where the customer would be if they're having to start over two or three times and re-explain everything. So it really helps streamline their process. And it starts to be a pretty clear picture of who makes the most sense because the technology represents the answer, right? And the capabilities of the supplier. And what we're also seeing is it could be multiple answers. Meaning one supplier is going to take this piece of it and this one's going to be this. And that's where that partner understanding the customer and helping them and manage that ecosystem of technology becomes really impactful. It's very, in Rackspace, you guys have the deepest, and this isn't because I'm on a show, you guys do have the deepest bench of products and technology, but there's still areas that you guys don't do, right? And so we'll pair you up with someone that can take this part of it and you guys will handle this piece of it. And so it presents a complete picture for the customer. Got it. Awesome. Well, by the way, it looks like, Dris, you've got a friend in Seattle up there, Kobe, so I just thought I would... Nice. Your fan is here. All right. Very good. Well, we are coming up to the top of the hour, but I do have one last question for you. As you are, you know, you're a technologist, you're VP of the cloud stuffs. And so when, and as we think about our conversation around AI, my favorite question to ask people about that is how are you personally utilizing AI to do the things that you do? I do a lot of stuff. Right now I'm working on trying to get it where I no longer have to manage my calendar at all. That's the bane of my existence. And if I can teach it how to do my expense reports with as much as I travel. So I'm actually looking into a couple of those things that it works out. It does to a degree, right? Like we have a program, I just throw the receipt in, it scans it, does that. It's pretty minimal AI at that point. But then it knows now it's starting to understand where to catalog it, where to go, where things. So I'm looking for things. I like to call it life as a service. Yeah, I'm looking to implement AI and as many components of my life as possible. I love it. All right. So people want to follow you, you're on the LinkedIn anywhere, any, anything else places you people come to find you? Nope. I think I'll stick to LinkedIn at this point. Any of the other places are keep that MySpace account private for now. Yeah, exactly. All right, everybody. Kobe, thank you so much for being a part of the program, getting up early with us here today. And folks, we are back next week. And but not on Tuesday, I know it's confusing you, but I've got a little travel that's going to have me on a plane when I normally would do this program. So next week, we have Rebecca Potts and she is from Google. This is the month of Google, by the way, you're going to find a lot of content from us as we head this road down towards Google Next. If you're going to be there, let me know. I'd love for you to send me a note and and we could connect when we're out there in San Francisco at the end of the month. But Rebecca Potts is going to be here next week. She's from Google, but that's on Thursday. We're going to have that chat on Thursday. Just watch for the LinkedIn invitation. Follow us there. Thanks to her for being a part of the program and saying thank you to us. That's always appreciated. All right. Is there anything else that I need to show you guys before we head off? I don't think so. Let's bring up the deck because with that, I think we are off. Oh, hey, by the way, Google Next. Thank you, Megan, for posting this. If you're going to be there, we're at booth 217. I'd love for you to come and and check us out there. Also, if you want to check out that article that we talked about earlier about co-pilots, you can find that over at Rackspace dot com slash solve or I can leave a little bit of dead space right here for you to bring up that QR code one more time. Daniel, if people want to go find that article, there's all kinds of great information over there, folks. I'd encourage you to go and check it out. But until next time, my friends, it's the end of music. It must be the end of this week's program. Don't forget to go subscribe to the Cloud Talk podcast. You can find it anywhere that podcasts are found. And until next week, that is next Thursday, the 17th. I'll be back with Rebecca Potts from the road. Thank you so much for listening to this episode of Cloud Talk Live. Now here at Cloud Talk, we strive to help decode the ever changing world of technology to help you apply it to your business so that hopefully you'll have one more tool in your arsenal to help improve your business. Those around you. Now, this was a live event which happens almost every Tuesday and Thursday at eight thirty a.m. Central Time on the Rackspace, LinkedIn, YouTube and Twitter accounts. Be sure to watch us there. Join the conversation live with us. Now, if you haven't already subscribed, I'd encourage you to do so and maybe even give us one of those five star reviews. These episodes can be found anywhere podcasts are found until next time. I'm Jeff Deverter for Cloud Talk and Cloud Talk Live."}, "podcast_summary": "Cloud Talk Live is a podcast where they strive to help decode the ever-changing world of technology and apply it to businesses. In this particular episode, the topic of AI and its impact on the job market and customer experience is discussed. With the increasing adoption of AI, companies are turning to MSPs and CSPs to handle the more specialized tasks. The episode also explores the challenges and risks associated with implementing AI, such as bias and security. The guest speaker, Kobe, who oversees cloud management services, shares his personal experience with using AI in his daily life, such as automating his calendar and expense reports. The episode concludes with a mention of the upcoming episode with Rebecca Potts from Google and an invitation to subscribe to the Cloud Talk podcast. Overall, the episode offers valuable insights into the current trends and challenges in the world of AI and its impact on businesses and individuals.", "podcast_guest": {"name": "Kobe Phillips", "org": "", "title": "", "summary": "Could not find detailed information about Kobe Phillips on Wikipedia. However, you can learn more about the guest here: https://www.instagram.com/kobephillips_kp/"}, "podcast_highlights": "Highlights: Cloud Talk Live is a podcast that aims to help businesses decode the ever-changing world of technology and apply it to their operations. The podcast features conversations with industry experts and covers topics like AI, cloud computing, and more. Tune in every Tuesday and Thursday at 8:30 AM Central Time on the Rackspace LinkedIn, YouTube, and Twitter accounts to watch their live events and participate in the conversation.\n\nKeynotes:\n1. Kubernetes as a service is becoming increasingly popular and is a key focus for customers looking to modernize their infrastructure.\n2. The use of AI in customer experience, specifically in call centers, is on the rise to automate tasks and improve efficiency.\n3. MSPs and CSPs are seeing growth as companies outsource their technology management to fill the gap in resources and expertise."}