{"podcast_details": {"podcast_title": "A Climate Change with Matt Matern", "episode_title": "122: Peter Fiekowsky, Environmentalist & Author", "episode_image": "https://audioboom.com/i/40141286.jpg", "episode_transcript": " You're listening to Climate Change. This is Matt Vattern, your host. I've got a great guest on the program today, Peter Fiekowski. He's the author of Climate Restoration, the only future that will sustain the human race. So Peter says that if we even if we get to net zero by 2020, by 2050, we'll still have a trillion tons of CO2 in the atmosphere. And we need to remove that CO2 from the atmosphere on a massive scale without huge government outlays and that's the premises of his book. And he's got four promising solutions for climate restoration. We'll talk to him about those. Peter's an MIT educated physicist, serial entrepreneur and philanthropist, as well as a social innovator. He's worked at NASA, holds 27 patents, so he must be kind of smart. I don't know. He's on the board of CapEx, a fintech company designed to help complete the global transition to 100% clean energy by 2040 by tripling the rate of investment. He's also started the Foundation for Climate Restoration. Peter's mission is to leave a world we're proud to, not to leave a world we are proud of to our children. So that's a that's a great mission. And Peter's got a 30 year track record as a citizen lobbyist for global poverty reduction and climate change. So without further ado, Peter, welcome to the program. Matt, thank you. It's a delight to be with you and to talk with your audience. Okay, tell us a little bit about your background and what led you to working on climate change and as in your role as an environmentalist. Yeah, I, you know, I grew up as a child of the 60s and 70s and my friends were demonstrating against the Vietnam War and I wanted to make a difference. I didn't know what I was going to do. I ended up doing astrophysics. And back in 75, I was 19 years old, and reading about global warming. I said, Oh, that sounds like a problem. But it was also very clear that we had to get a lot of co2 out of the atmosphere, eventually. This was the beginning of the Environmental Protection Agency. And so we were optimistic about these things. And the thing that I knew is that we, we had submarines, we had spacecraft where they got co2 out of the air. So it wasn't like we had to invent anything terribly new, we just had to do it better. And that was a matter of engineering. And as a freshman or sophomore, I didn't know any engineering because I was studying physics. I said, Oh, let me leave that to the smart people, the smart chemical engineers, and I'll keep studying astrophysics. Because if I do astrophysics, if I screw up, no one dies. And, and so I got clear it was important, and thought, thank God there are others who will take care of it for me. And I went off and followed my bliss and did astrophysics and worked at NASA, worked in artificial intelligence, had a grand old time here in Silicon Valley. But as you can tell, the leaf turned, and 35 years later, it was 2010. And I've been doing volunteer work in poverty reduction, advocating to get funding to vaccinate the world's children, to get microfinance going around the world. We worked with President Bush to get funding for AIDS treatment, all those things were wildly successful, right? Children around the world are vaccinated, and that's changed the world. Microfinance is available everywhere. And of course the turning around to the AIDS epidemic made a huge difference. I was spoiled because I was just here in California, supporting groups, but I was involved in these Earth, these planet changing things, and took it for granted. And so when 2010 came, and I could see that all the progress was leveling out, that I had, that our progress was going to stop because of global warming. And so I went back and I said, you know, maybe I was wrong, maybe it's not so easy just to get the CO2 back out of the atmosphere. Let me see what's going on. I discovered that no one was working on it. And that was the point at which I reluctantly agreed to take on climate restoration to lead the course. So I think we may have had some similar path in terms of, I believe that in doing some research for our interview, I saw that you had worked with the group results, which I had worked with back in the 80s, and they were very, you know, successful in, as you said, getting funding for lots of anti-poverty programs around the world, which were quite successful. So maybe you could tell our audience a little bit about your work with that group. Yeah, it was, you know, in retrospect, it was profoundly changing, transformational for me. When I started in the mid 80s, it was just after we got the request from the head of UNICEF, James P. Grant, to get funding for the child immunization program they had promised, starting in 78. And they promised to vaccinate all, to have all the kids on the planet be vaccinated every year by 1990. And in 85, they realized that they were barely halfway there. And of course, it's the last half is the hardest half. And with the Reagan administration, they were despairing of getting any funding. And we took it on, we just simply talked with members of Congress and newspapers and pretty much everyone agreed and we got the funding and vaccination rates went from 8% in the 70s to 85%. And they've been there ever since, ever since 1990. At the end of the conclusion of that project. Right, as I recall, the focus of the results group was just writing letters many times and talking to elected officials to get them on board and that process of public education. People to start, you know, they saw the benefit to the US as well as to the world by engaging in this process of getting kids vaccinated and the anti-poverty programs. What's the thing that we could do as citizens? Is there a similar organization that has developed that that's doing the same thing regarding climate issues? Well, we are foundation for climate restoration foundation for climate restoration.org has local chapters, which says similar things so they work with members of Congress and help them get rules introduced, and so on. So it's a much earlier stage than results. We first results is, oh my God, almost 40, almost 50, I don't know, 45 years old now I think. A couple weeks ago at the beginning of July, we got a bill introduced and passed in the California Senate, and it's the first ever resolution for declaring a commitment to climate restoration. So the main barrier, as we'll discuss shortly, for restoring the climate. It's not technological, it's not even financial, the issue is political, that our outlook on climate was really established around 1980 when Reagan took over and changed the direction our country was taking with regards to climate. And the UN in 1990 said that our climate goal is to stabilize the climate, which, you know, if you look at the weather we're having now, we really want to go back to what it was 40 or 80 years ago, we don't want to stabilize it at the horrible problems we're having now. So, the main thing we're working on is getting the to build on this resolution that was passed unanimously in the California Senate, a couple weeks ago. And so introducing it in what we're looking for members of Congress to introduce it in the House and in the Senate in the next few months. How would you define climate restoration. Well, climate restoration is simply defined as the goal and the actions to restore the climate back to levels that humans have actually survived long term, to make sure that our children and grandchildren will survive. It seems like a reasonable goal. I mean, it's hard for anybody to disagree with that one. Yeah, it was great. I'm friends with the California senator who introduced the bill. And I talked to his staffer after it got introduced and went through committee and he said, you know, there's no opposition to this. And on the one hand, like, of course, there's no opposition to it. Then at the same time, there's that surprise I can see on your face and you can see on my face like, oh my god, I find that idea that where there's actually no opposition. Well, it's a it's brilliant framing of the issue, so that getting 100% buy in so the that's that's a step in the right direction because obviously there's been a political will issue on this that has gotten in the way of people, politicians buying into it, and I think there, there are some ways and we can talk about them. After the break, in which we can find common ground, and I think that talking about future generations and looking seven generations out or looking at the spiritual principles that many people buy into, or, you know, believe in like doing to others as you would have them doing to you. You know that those types of principles lead us to climate restoration, they lead us to non pollution if we follow those principles. It's it pretty straightforward that we shouldn't be polluting. Right. You know you're listening to a climate change I've got Peter Fikowski on the program and Peter and I will be right back after this to talk about his book climate restoration, the only future that will sustain the human race. We're going to change the world if we do it together. We're going to change the world if we do climate change, and I've got Peter Fikowski on the program and Peter is talking to us about his book about climate restoration. Peter, tell us a bit about the book what it what's the main thesis, my understanding is that you've got for promising solutions for climate restoration. What are the solutions and what should we be doing to implement them. Yeah, well the main thesis isn't the solutions, the main thesis is that we all, as we said, a few minutes ago, we all want to restore the climate, everyone does, which is amazing we have the same climate goal. We all know what's needed to get CO2 back to pre industrial levels. And the barrier to doing it is, is creating the will, and it's not and it's not we have the technology. And a side conversation on it is simply that the, the climate issue was born out of population, that is there's 10 times more people on the planet than that than before the Industrial Revolution. And we don't want to go back by a factor of 10. But, but most people agree most experts agree that getting back to where we were 100 years ago would be very good for maintaining the our ecosystems, and the very cool thing is, you know as a physicist, I look at the big picture, you know, and at the end of the century. And with birth rates going down around the world. It's really natural for policymakers and especially for women who give birth of course and their partners to target the right size families, which is one or two kids, and that's really all there is to say about populations that we can do it. And the other thing that we haven't is, you know, when I was a kid we talked about zero population growth, which is like stabilized and climates like there were too many people already. This is crazy talk. And so the whole mission of the book is for us to say what we really want. And now what we're willing to settle for. In terms of sustainable population growth, you hear people like say Elon Musk, saying, No, don't, don't slow down the rate of population growth have 10 kids. What's your response to Mr Musk on that point. Yeah, my response is this, and it's the same thing for the climate that what we want a sustainable population and a sustainable climate and anything above that. We're playing Russian a lot with our kids. They may survive, and they may not. And if you think about it in terms of Russian roulette, of course, we're taking all the bullets out of the barrel. There's no other thing that that were that's moral to do. And so, some people when they're not thinking straight, they'll say, Well, I think we could survive, you know, with two degrees or 10 degrees warming, or I think we could survive with 11 billion people. But, you know, when they settle down and say, No, actually, we don't want to play Russian roulette. Let's just go back to the levels that our planet has sustained for 10,000 or a million years and well 10,000 years. And certainly a bit safer to take that approach, because we all know that the every human that takes a certain amount of, you know, energy or, you know, there's a certain amount of usage of raw materials for every person who's here. So obviously spending, having more people, it's going to cause more usage of all those things. So it's really not rocket science to come up with that, that solution. Now, in terms of yours, on that point, what's really interesting, and if you have people who love googling and plotting graphs, if you look at the CO2 emissions, it tracks perfectly population. And when I first saw that I got a headache because I said, No, wait a minute. You know, most people in the world aren't driving cars like I do. And they're not flying like I do, but they're more of them are driving and flying. It's like, how is it that the two, those two graphs match perfectly. But it's interesting that the emissions and the population match perfectly going way back, probably 150 years. Just an interesting fact. That is interesting. So that seems like it would be a worthwhile goal among others to reduce the rate of our population in order to reduce the rate of emissions. And consuming all old resources, you know, forests and minerals, all that. Yeah. Right. In terms of some of the solutions you have for climate restoration, I know there are two of them that were kind of top burner ones for you were related to the iron and the methane oxidation. Tell us a little bit about those methods. Yes. So, you know, I came about these gradually. And, you know, I first talked to the scientists of eight years ago and said, How do we get all the CO2 out? And we listed 10 different ways. And the scientists were all amazed like, Oh my God, we could actually save the planet. No, I never thought about that. I've been working on climate for 25 years. And when all was said and done, the methods that pan out that really make sense happen to be exactly the ones that nature uses. And it's not too. After it after about five years, it made sense to me. I'm an MIT physicist, so I was going for the high tech solutions coming out the gate. I'm not a natural guy. But nature has figured these things out over millions and billions of years. So we have ice ages every hundred thousand years, roughly. And the way and how does nature cool the planet down? What has to remove a lot of CO2, as you said, a trillion tons or 1000 gigatons. And how does it do that? Well, it does it with photosynthesis, of course, in the ocean. So photosynthesis on land is trees, but trees we all know die and then they rot or burn and this carbon goes back into the air in the ocean when plants grow. And when they die, they the fish and the plants sink into the deep ocean. And there's no oxygen in the deep ocean. There's very little and they don't rot. And so before ice ages, there's a lot of photosynthesis in the ocean for reasons I'll explain in a minute. And the plants and the animals sink into the deep ocean. They become what they call dissolved inorganic carbon and just hang out there for 100,000 years or so. And then oxygen becomes available and the CO2 comes back out again. We can do the same thing. What happens in nature is to get the photosynthesis going in the ocean requires putting in the missing micronutrient. And that's iron, just like it is for animals and land plants. They need a little bit of iron or it just does the biology doesn't work. And in the ocean, iron tends to sink. And so the only source of iron in the deep ocean is windstorms, is dust storms. And so we can provide before ice ages for various reasons, they get more dust storms that carry iron rich dust into the ocean. And that causes more plants, which is algae or phytoplankton to grow in the ocean. And that then pulls the CO2 out of the water and out of the air. We can do the same thing. And the amount of iron required is amazingly low. It's about well, per square meter places that you do it. It's about a hundredth of a teaspoon per square meter per square yard. Overall, to do the whole thing requires about five million dollars of iron or actually iron sulfate per year. That's it. Five million dollars and then probably one hundred million dollars for ships to distribute it at the right places in the right time. It only takes about one percent of the ocean to to be turned green because the I like blue ocean. I imagine you do, too. But blue ocean isn't green. And green is when you have photosynthesis. And so the idea is to turn certain parts of the ocean at the right time, turn them green, just as nature does when there's a dust storm, say from the Sahara. The Sahara is pink because of iron in the dust. And when it blows across the Atlantic towards the Caribbean, I think that's actually happening right now. The Atlantic Ocean turns bright green because that missing iron is available to allow the phytoplankton to grow. So that's the phytoplankton. Very viable and really quite fast. Well, that's fascinating. Certainly, I've had some other guests on the program. Captain Paul Watson from. Oh, yes. And he has talked about the dramatic reduction we've had in phytoplankton and that phytoplankton is a very big source of our oxygen on the planet. So if we kill off our phytoplankton, we're pretty much toast. So, yeah, yeah, you know, I'm glad that you worked with results as well. You know, the power of a positive message like here's what we're going to do when you and I were active in results decades ago. We didn't talk about whose fault it was. We never did. It was always like, OK, good. We're going to provide your vaccinations or something else. And so we're doing our climate work is the same thing rather than complaining about how bad it is. We're saying, OK, here's the deal. We're starting. We're actually in the next this month, we're starting the grandparents fund for climate restoration. And so the idea is that who's going to pay for this? It's not a lot of money. Like it's a hundred million dollars for the iron fertilization. The methane that you mentioned we can talk about in a minute is probably a billion dollars a year. It's not a lot of money, but it's Peter. We're going to go to break for a minute. We can come back and talk about the methane and many other things. You're listening to a climate change. This is Matt Madden, your host. I've got Peter Fiekowski, author of Climate Restoration, the only future that will sustain the human race. So very important stuff. Stay tuned. You're listening to a climate change. This is Matt Madden. I've got Peter Fiekowski on the program and Peter, we were just talking about your book and you had gone through this kind of your hypotheses. I guess the projected science project of putting iron in the ocean. It sounds good. I guess I do have a follow up question for that in terms of we've seen obviously men interfering with nature to a certain extent or to a great extent in many places. And humans generally have a bad track record of messing with nature. So given that premise, should we trust you and others to put iron in the ocean? And is it worth the risk? Yeah. Well, so two things. The first one is nature has been doing it for millions of years. And so we're doing the same thing nature does in 13 experiments over the last 25 years of this iron fertilization. There's been zero reports of any detrimental side effects, which is not surprising because again, we're doing the exact same thing nature does. It's just rather than dust, winds blowing the dust storm, we actually take the minimal amount of dust and put it in just the right place where we want it. And so, so you historically it's safe. No one has proposed any real reason it's not. Now people who don't understand it, say, well, will it cause a harmful algae bloom? And the answer is no, because harmful algae blooms happen near the coast, where there's lots of nutrients washing off the shore. Iron fertilization is done in the deep ocean, where nutrient levels are almost a million times lower. And so it just never happens. Well, let me ask you in terms of follow up and what are the, where you at in terms of the process of actually doing this and what kinds of approvals do you need to get to do it and what are the next steps on actually effectuating the plan? Yeah, the tests have been done. You can read in the book about a wide range of them or on my website, Peter Fikowski.com. And we've been hoping for quite a few years to redo a test that was done in the Gulf of Alaska in 2012, 11 years ago. And that one, they, I'm told that they removed about 100 million tons of CO2 and the algae, which is essentially food, it's the base of the food web. That's where fish get their food. They were, the fish catch, the salmon catch in Alaska the following year went up about four fold for the pink salmon. And so it was successful. We're hoping to do it again. I don't know how long it'll take. And I guess your main question is what would it, what would it take to get it started again and tested more formally? The problem that they had 11, 12 years ago was that they felt that people didn't really want to restore the climate back then. We hadn't even invented the term. And so a lot of people were nervous, as you said. They said, well, humans shouldn't intervene on these things. We should just stop intervening. They don't say it, but it's sort of like, maybe we should go extinct and that'll be best for nature, which may be true, but really is not what I think any of us are really interested in. What's nice about what we're doing is rather than saying, well, people talk about geoengineering and they say, is this geoengineering? And I say, well, it's not really, I call it terraforming the earth to look like earth again. So when we think about geoengineering, it's like taking rabbits to Australia and hoping it's going to work well. And if it doesn't work well, we're sort of screwed. And they had that problem in Australia. In this case, we know exactly the outcome we want, which is to get CO2 back, get the climate system back the way it was 10,000, actually just 200 years ago. And almost everyone knows the climate is a function of CO2, so we just have to get the CO2 back down and we should do it the way nature does it. Well, I certainly like the elegance of it. And I like that you're just kind of using a natural element without any kind of additives or preservatives attached to it. And that certainly helps my confidence level. And I say testing it in certain discrete places to make sure that it does go according to plan and have protocols in place where we're really looking at it carefully to make sure we don't kind of screw it all up. That seems like a worthwhile way to start. And now tell us about the the methane oxidation plan that you have and how does that work? Yeah, so methane, you probably know, is a very important greenhouse gas. It absorbs about a hundred times the impact of CO2 in the atmosphere. And methane, which is the gas that we use in our gas stoves and furnaces and so on. Methane naturally oxidizes in the atmosphere. There are chemical reactions that happen, mostly triggered by sunlight. And the methane oxidation program is that the goal is to double the rate at which nature oxidizes methane. So again, it's take the same thing that nature does, but do it at just the right place and just the right time with the right compounds to double the rate. And by doing that, we can cool, cut this level of CO2 in half. And because CO2 is such a critical greenhouse gas, that will bring the temperatures back to what they were about the turn of the century, about 20 years ago, which would be fantastic because that was before the huge hurricanes and huge firestorms and so on. So how would you double the rate of methane oxidation? Well, the chemical that we're testing now and it's been recommended for about six years is iron chloride. It's a chemical in wide use in water systems, both water supply and sewage treatment. So it's a very commonly used chemical and it does occur naturally in the air as dust when you have iron in the air because the chlorine comes from salt, from sodium chloride. And so what the plan is to emit an aerosol, which is a mist of iron chloride and salt in certain places where the humidity is low and the sunlight then knocks one of the chlorine atoms off the molecule and that chlorine atom like chlorine bleach will oxidize any methane molecule it hits. And the testing we've done so far shows that it works. Hopefully in the next year or so we'll do some outdoor tests. As I said, the chemicals used widely, you've got to put it in the right place at the right time. It's not like it's the unusual chemical, but it's not normally at the right place in the right time where there's the UV light from the sunlight available in the low humidity and the right pH and so on. I read a little bit about this. There's some questions as to how does one do this, it seems like the government, at least in the US and I think in other developed countries are pretty negative about spraying aerosols of this type up into the air and, and there's questions about how it would be regulated. So tell us a little bit about that and where you're at in terms of negotiating with the governmental bodies to let this happen. We've had discussions with the shipping industry and the shipping industry of course are expert in satisfying the International Maritime Organization and national requirements. And with both of these, there is no limitation on doing it per se. The issue really is making sure we communicate with the public exactly what we're going to do, how we're going to do it, how we're going to ensure the safety. The amount of material so insanely low for both the iron fertilization and the methane oxidation that it's not that big an issue. It's primarily a communications issue is the limitation, because the iron fertilization for example has been discontinued for about 12 years, and the people who did it they said, listen, there is no actual law against doing it. But we've been able to produce the media to make people think there's a law against doing it and they're correct. All the experts say there's no law, because it had a huge benefit on the fisheries, but even the fisheries are ready to put a little bit of iron in to feed their fish, just because people made them believe that there's actually a law. There's a recommendation to be careful about it. Anyway, but so it's a communications issue. Not a specific legal issue. There's no, do you want to work with the Coast Guard, make sure they know what you're doing and all of these things, but there's been no objection. That kind of leads to another question, kind of the law of the sea is, it seems like somewhat vague and amorphous. I mean, not everything is regulated out in the open ocean and one of the things that is happening out in the open ocean is some degree of mining, maybe the mining for minerals for things that would go into batteries for EV cars and the like. Maybe when we get back from the break, you can comment on that as well as a lot of other issues I have. I'd love to talk to you about. You listen to a climate change. This is Matt Maddern, your host and I've got Peter Piekowski on the program, author of climate restoration. We'll be back in just one minute. You listen to a climate change. This is Matt Maddern, your host and I've got Peter Piekowski on the program. Peter, right before the break, we're talking about the underwater mining. I was curious as to your take on that and whether or not that's a good thing for us to be doing or, or if we should back off on going that path. The underwater mining sounds like a bad idea. That is really what we want is to get our economy back to a circular economy. I was reading about battery remanufacturing, how do people recycle batteries, that technology is growing rapidly and more and more countries are requiring that people who sell materials have a recycling method for it. It's crazy to disrupt the anymore. And like we said in the first section. It ultimately boils down to having a sustainable population. People use resources that we just like the adventure, we like to own things and build things. And I want to encourage listeners to plan on having small families, encourage your kids to have small families, because that's what's going to keep the planet beautiful. In terms of the scorecard of the government, how is the US government doing? And then also kind of teeing it up for if you were making the decisions on that front, if you were the king, what do you think would be the top five or 10 steps that you would have the government take moving forward? Yeah, the Inflation Reduction Act last year, I think was a phenomenal success in my book that I have a chapter on the energy transition. And if you think about it, when the energy transition is done, what we're going to have is all the energy we use for driving and heating our houses and factories, all that is going to come from renewable sources. And that means to get there, we have to build up the renewable sources. At the moment, that's solar and wind. There will always be a certain amount of nuclear, there are people working on fusion and so on. But the point is, complaining doesn't make that much difference. Building the wind and solar and batteries, that's how you make the transition happen. And the Inflation Reduction Act was brilliant in terms of encouraging people to invest in all that infrastructure. So I'm just really pleased with what they did there. What do you see? Okay, sorry to cut you off, but what do you see as the next steps for the government and where would you direct us to go? The next step is to build on this focus on restoring the climate for future generations. That's why we had the resolution and get through the California Senate. We want it to go through Congress. And it's really important for the government to say, really, we're doing this for our grandkids. When the country was established 250 years ago, we didn't need to worry about whether the planet would sustain human life. There's nothing in the Constitution requiring the government to maintain the planet, because it didn't occur to them that that was a problem. That's a problem now. And our great-great-grandchildren won't survive on our current path. We need to change that path. And we have an administration now which has the cojones to actually do that. And so talking to the Secretary of Energy and talking to the Vice President and the President and John Kerry saying, listen, make sure we restore the climate. That's the next step for the government to take. The actions to take, as I said, they're really inexpensive and they're not being done simply because we're following rules built in 1980 and 1990 when the planet was a different planet. So in terms of if you had a, you know, the Mount Rushmore of climate change, you know, heroes, who would you put on that? Oh my God. Oh my God. You know, it's been pretty lonely on my climate restoration site. Let me tell you, Sir David King in the UK, he was the first high level person. He retired from working on climate after the Paris agreements in 2015 and met me a year or two later and he really adopted climate restoration. He renamed it in a gentler way, climate repair. I scorned that a little bit, although I had the deepest respect. I was saying, do you want to give your cars, your kids, a repaired car or a restored car? And so I want to give our kids a restored climate. I want to give them the same thing that you and I had growing up or our parents had. So Dave King, Christiana Figueres, she has the heart. I'll leave it at those two. She brings just her heart and her love of humanity to her work. And she hasn't spoken out about climate restoration yet and I suspect she will very soon. What about some of the books that have been written recently about this? John Doar's books, Speed and Scale, Bill Gates book about how to prevent a climate disaster. Do you think that those plot the path for us to go or is there something that they're missing there? Yeah, I admire their courage and their boldness to speak out and write the book and get it promoted. Have you ever heard an expert say that if we actually achieved net zero by 2050 that we would have a chance of survival? No, no. The temperatures are so high now and the climate is going bad. The ecosystems are collapsing here and there. Life will continue on the planet on our current trajectory, but it won't look anything like you and I grew up with. So I would accuse Gates and Doar of being resigned about the climate and not knowing that they're resigned. They're acting like there's nothing we can do to restore it and give our children a climate that we know is going to work. And so I want to wake them up. I don't know quite how we're going to do it other than with our resolutions and maybe they're going to listen to our podcast here. Well, you just got to keep putting in those ideas out there and eventually they start making waves. So, you know, I think that you're you're on to the right path and I, you know, I admire the work that you're doing. So on a personal level, where do you where do you land as far as personal sustainability and having a car versus mass transit, taking trains or planes, vegetarian? What role does that have in addressing climate change? Well, it's very symbolic. So, you know, I had the career I have. I'm here in Silicon Valley. I don't drive much because I work out of my house and have for decades. One of the turning points in my life was putting solar panels on my house because I wasn't into the client. I said earlier, I had said, let the experts take care of it. I'll do the hard, hard things like astrophysics. But I noticed when I look out my window at the at the panels on my roof, it always reminds me of my commitment to our children, which is why I put the panels on my daughter in high school said, Dad, how about solar panels? I said, it's not going to pay off well. You know what? What the hell? For my daughter, I'll do it. And it transformed my life. And so being vegetarian, all these things, it's not so much that they're going to save carbon, they really don't save much carbon a little bit. But they change you and let them change you. And they change the perspective you have and that changes the actions you take. I think that's well said. And I think there's that balance between personal kind of growth and growth as a community and as certainly to the extent that we're authentic is being leaders and and our commitment to doing it personally kind of gives us a little bit more of an authority to ask others to make that change as well. If we're not doing much personally, it's harder to make the pitch that other people should do much. Yeah, you know, I started mentioning we're creating this grandparents fund for restoring the climate, and it's not open for business yet it will be by the end of the month. And I invite everyone to find it if they remember, it'll be the grandparents, grandparents fund for climate for climate restoration. But the point is that you'll be able to make a monthly donation that will actually fund the ocean fertilization the methane oxidation, the governance we're putting together a global governance group that will make sure that all these things are done safely because currently there's no government with authority to keep the planets, the climate safe, right, it wasn't needed when all our governments were created. And so we said well we'll do it as a simple nonprofit. And we already have a group at the Hague in the Netherlands want to bring it in to the Hague, it'll take a year probably. But the point is, people can get involved and the best way to get involved is with an end with a monthly donation. I love neuroscience and what happens is when you take that monthly action that trains your brain that you're committed, just like I looked up at my, my solar panels, it tells my brain that I'm committed to the climate, and I hadn't thought about that. Yeah, that's, that's brilliant and I often say the, the phrase that Gandhi had, which was be the change you want to see in the world and so if you are doing those things on a daily basis or monthly basis you start to really exude that out into the planet. It's been great having you on the program. Peter Fiekowski, author of Climate Restoration, the only future that will sustain the human race everybody go out and get a copy of that book. Also check out Peter's foundation, the Foundation for Climate Restoration on the internet as well as his social channels also tune in to our social channels at climatechange.com and Facebook, Twitter, all that stuff, as well as take a look at some of our old episodes you can look at them on on Apple and Spotify at a climate change.com and also at climate change with Matt Matter on Spotify and Apple. Tune in next week we've got some great guests coming up and you can always listen in to the earlier part of Peter's interview if you missed the first part on the radio it's it's on the internet so everybody have a great week and as Peter said, get engaged and start doing something because that will change the planet."}, "podcast_summary": "In this episode of the Climate Change podcast, host Matt Vattern interviews Peter Fiekowski, author of the book \"Climate Restoration: The Only Future That Will Sustain the Human Race.\" Fiekowski discusses the need to remove a trillion tons of CO2 from the atmosphere and presents four promising solutions for climate restoration. These solutions include iron fertilization of the ocean to promote photosynthesis and CO2 absorption, and methane oxidation to reduce the emissions of this potent greenhouse gas. Fiekowski emphasizes the importance of taking action to restore the climate for future generations and discusses the need for government support and public awareness. He also highlights the role of individuals in making sustainable choices and supporting initiatives for climate restoration. Fiekowski's book and foundation, the Foundation for Climate Restoration, aim to raise awareness and funds for these solutions. The interview also touches on the significance of population control and the transition to renewable energy sources.", "podcast_guest": {"name": "Peter Fiekowski", "org": "", "title": "", "summary": "Could not find detailed information about {podcast_guest} on Wikipedia. However, you can learn more about the guest here: {search_results[0]}"}, "podcast_highlights": "Based on the transcript, here are a few hot topics with potential for further discussion:\n\n1. Climate Restoration: The main focus of the interview is on climate restoration and the need to remove CO2 from the atmosphere on a massive scale. This is presented as a solution for achieving a sustainable future for the human race.\n\n2. Iron Fertilization: Peter Fiekowski discusses the method of iron fertilization as a way to restore the climate. By adding iron to the ocean, it promotes photosynthesis and the removal of CO2. There is a debate about the potential risks and benefits of this approach.\n\n3. Methane Oxidation: Another solution proposed by Fiekowski is increasing the rate of methane oxidation in the atmosphere. This involves adding an iron chloride aerosol to trigger chemical reactions that lead to the oxidation of methane. Again, there are questions about the feasibility and potential consequences of this method.\n\n4. Government Action: The conversation touches on the role of governments in addressing climate change. The passage of the Inflation Reduction Act is highlighted as a positive step, but there is also a call for increased government action to prioritize climate restoration for future generations.\n\n5. Population Control: The conversation briefly touches on the idea of sustainable population growth and the need for smaller families to reduce resource consumption.\n\nThese topics, along with the potential risks and benefits associated with the proposed solutions, can create further discussions among experts and the general public."}