{"podcast_details": {"podcast_title": "The Movie Podcast", "episode_title": "Blue Beetle Movie Review", "episode_image": "https://image.simplecastcdn.com/images/48d7eda6-2fa5-495d-9aa5-83d7e707e924/14934ce2-e3d9-4ed0-8d1f-c1f6e625df8b/3000x3000/dark-mode.jpg?aid=rss_feed", "episode_transcript": " Hello and welcome to the movie podcast review of Blue Beetle. My name is Shabazz and of course I'm joined by my caida, Daniel. Daniel, how are you doing today? Hello, I thought you were going to call me a scarab, but I guess you kind of did. I did, I did, but I called you the correct form. I don't want to call you a scarab because I feel like it almost sounds drogatory in a way. It does, yeah, you scarab. Doesn't it? It does sound a little bit. I don't like the stank. I don't think I could say that. No, no, I don't think I can say that. You shouldn't be allowed to say that. I take it back. Yeah. I take it all back. How are you doing today? I'm good. You know, I'm excited to talk about Blue Beetle. I'm wearing blue right now. Yes. I'm a Blue Beetle fan, which is great. So I'm really excited to dive into this movie, which if you've seen our social reactions for, Shay and I, you know, spoiler alert, we did have some criticisms for it. Thoughts. But what I love so much about what the movie podcast can be is that it can be a platform to talk about movies. Who knew? But not only just talk about things honestly, but openly and fairly. But as we always do, you know, we're honest, but we're not mean. We're critical, but we're not negative. And I think that's the most important part about what we do here on the movie podcast, is that if you're looking for, you know, a clickbait headline of like, this is the worst movie ever. Well, I guess I kind of just gave it to people. Yeah. But it's trash. That's not what we do here. We're here to be honest, because at the end of the day, we love all movies and we want to talk about them. We want them to succeed, right? At the end of the day, like even if we're not looking forward to something, we still want it to succeed in whatever way that that studio or the director or whoever is part of it sees as a success. So exactly what you're saying, we will have some thoughts about it. But again, on the show, we're not going to be rude. We're not going to really tear down a film or something. It's just about the criticism. It's about honesty. If you want to come at us in the comments, please do. Because I mean, let us know if you love the movie. The movie has great reviews right now on Rotten Tomatoes. So we would love to hear your thoughts. If you do go see it. There's been a lot of great fan screenings out there. A lot of people are, you know, buying tickets to to show different communities. So definitely let us know if you have seen it and what your thoughts are. You can also join our discord where you can have this conversation as well. Our discord is right now as poppin. It's poppin, right? And I think, like she said, like leave a comment because that's what the comments are there for. We have some great platforms that you could follow us on at the movie podcasts everywhere. So use those channels to talk with us and let's have a conversation about it. Right. That's at the end of the day, like we want to build an incredible community of movie lovers, of entertainment lovers. That's what this is here for. So so use it and, you know, hopefully we could have a good time. Also, I feel like we're preparing this interview. This blows so much interview review. What is this today? It's a review. It's a review. We do have interviews out on the movie podcast. So we have interviews out with so many incredible people, including the director of this film, Blue Beetle. So shout out to Warner Brothers for, you know, giving us time with him on the red carpet in Toronto. We had just to be clear as well, we spoke to Danielle Manuel Soto before we actually watched the film. So just just to be clear. Yeah, just to be clear. Yeah. But we we spoke to him before and also obviously we acknowledge that there is a writers and an actor strike going on. So we didn't have any other interviews for this film. So we stand in solidarity with the writers and with the actors, you know, as you know, as Anil said, when the premiere of this film happened this week, that like, you know, this is a big opportunity for all of the actors in this film that they they weren't on the carpet for. Right. And that's a big opportunity for them to miss out on. So we're really hoping that, you know, the actors and the writers in the studios can have a resolution fast because writers and actors deserve to be paid what they're owed. And there would be no movie podcast if the writers didn't write the words and the actors and bring those words to life. So let's make a deal happen, please. For sure. Let's go ahead and talk about Blue Beetle. Now Blue Beetle is starring Shola Meridwina and George Lopez. You have Bruno Marcuse Bruno Marcuse and of course directed by Aniel Soto. I know I'm sorry about that. And of course, starting Susan Serman and I kind of forgot about I'm so sorry. I'm surprised you forgot about. There's a reason why I forgot. And we'll get to that reason so, so quickly, so quickly. And of course, the film will be out in theaters August 18th. I almost said April because I my mind is trying to go back in time. We're pre we're we're right. We're not we're we're not striking here yet. Maybe that's why Anthony's not here. Maybe he's not maybe he's on strike. He's being scarab. Yeah. Yeah. That's that's the new term we're going to be scarabing right now. He's a he's a scarab. He's not a scarab. He's a scarab. No, but of course, this movie will be on theaters and thank you to Warner Brothers as well for 100 percent inviting us to come watch this movie. Daniel, I would love to kind of get your first thoughts. I mean, again, we're not just you and I sitting in this room. We're talking about this film. Tell me what were your what was your first reaction to this film? Here's the thing for me. I think I want to kind of preface this with there's a lot of baggage going into Blue Beetle and that's what I think. What do we bring to that? Yeah. I think what's unfortunate right now about about where Blue Beetle is releasing at the end of August, which typically isn't always the greatest place to be dropping a massive tentpole movie. And we've been told by James Gunn that Blue Beetle is the first superhero of the DCU, but it's not the first DCU movie, which obviously we know is going to be Superman Legacy in twenty twenty five. So that already is a little confusing and like I know it sounds straightforward, but it's OK, but like is does it like the characters on the first movie, Blue Beetle is going to be part of the DCU. But is this movie going to be part of the DCU? Is Sholo going to be coming back as Hami Reyes? You know, is that are any of these characters going to come back? And I think the year that Warner Brothers has had with releases, Wishes and Fury, the Gods, which we enjoyed, we had a good time with Flash. The Flash came out. I mean, that that's that's enough, you know. And now Blue Beetle, you're missing one. Am I missing? No, well, we have at the tentatively Aquaman at the end of this year. But I think I think that's it for DC this year. Yeah. So we have Aquaman potentially coming out later this year. That's four movies. That's four movies. So it's a very, you know, busy, busy, busy year and a year where it's like, OK, DC isn't having the greatest streak right now when it comes to the Batman. You kind of see behind me like is one of my favorite movies of all time. I'm so level one of Brothers Day and what Matt Reeves did with that film. And then we went to, you know, DC League of Super Pets, its own kind of thing, animated world, Black Adam. We know what happened to Black Adam. So there's a lot of baggage going into this. And I think the brand of DC has been a little damaged by all of these releases. So I think Blue Beetle out the gate is a little bit being set up to fail. And what Blue Beetle does so well and what I really enjoyed in this film is the family dynamic. I mean, the Reyes family, I think what makes them so special compared to all of the other superheroes out there. And you know, and Aniel spoke about this in your interview with him, is that his family, the Reyes family from the get go know that Jaime, you know, has this scarab in him. Right. And I think that's what's really cool about it is that they have this connection to their your brother, their son, their grandson, and they're all on this journey with him. And I think that's really cool. And that's the heart of this movie. And I think that's what works the best in this family. In this family. And this film is, you know, the Reyes family. And for me, going into it, like I am a fan of Blue Beetle. I was introduced to him really for the first time in Smallville, an episode of Smallville, I think was season nine or season 10. And then Young Justice season two. And for my Young Justice fans out there, my YJs, you know, my YJs, my YJs. When you look at how instrumental Blue Beetle is to that season on that show, one of my favorite animated shows of all time, season two with the reach and the scarab and him finding his place. And that is, I think, the quintessential version of Blue Beetle for me is, is that Jaime Reyes. He is phenomenal. Go watch Young Justice season two, because I don't even know if we're going to be getting a new season. And we're in a very weird limbo with animated that with that animated world. But anyways, let's get back to the film. Let's get back on track here. This is a very messy movie. Blue Beetle is a very messy film. And I think what disappoints me most about it is that we're getting an introduction to this character and it just feels like I've seen this movie a million times before. I don't think I've ever seen a superhero movie rely on so many tropes, so many archetypes, so many just cliches, cliches of, you know, for lack of a better phrase, copy and paste of what we've seen a million times before. It doubles down on them, actually, and it doubles down on them. And it's like it was it was coming to a point that you and I were leading over to each other, Shane, or like, this is the line they're about to say. There it is. There would be something introduced and we'd say that's going to become important later or this is going to be a factor later. And I remember looking at him like, I bet you I think it was maybe like 20, 30 minutes into the movie. I was like, I think this is what the after credit sequence is going to be. Yeah, yeah, let's see. And then the after credit sequence ended up being word for word exactly what we said. And it's exactly that. And I think that's what's so disappointing about this movie for me. That's what it really failed to do is really failed to do anything new. I do want to commemorate it for obviously, like you said, the Reyes family having like, you know, this is the first Latino led, you know, superhero film. We've had Latinos in the superhero films before, but this is the first time we're having a leading man in this role. And I think Sholo, he does a good job. But I also feel like the story that's given to him relies him to lean on so many extremes of emotion. Now, and it's either like super happy or just like he's being tortured and he's in pain and he's screaming. No. And I wish that there was time for him to really, you know, have an identity of his own. And I don't think that this movie really gives Jaime time to really just figure out who he is. I mean, they're so invested on this mission and on this on the story, and they're so at the mercy of but what's next? But what's next? What's going to happen now? You're never given time to just, you know, figure out who this guy is. And I think of a movie that this movie really tried to emulate Spider-Man homecoming. We're just like, let's have a character where, you know, Peter Parker is this down to earth kid, you know, you know, friendly neighborhood Spider-Man, you know, do good in the neighborhood. And I think it misses that connection to the grander scale. And also the city that they're in is a little, uh, uh, got a blank on the name of the. Yeah. Where it's like so futuristic looking. It's extremely futuristic looking. And then it's inconsistent. Yeah, it's inconsistent. So like you never get a sense of the city that they're in or the community that they're in. You know, they're told that like, you know, like, you know, this, like this, this company court is, you know, taking over its court, right? Yeah. They're taking over and you know, everything outside of the tracks and here, and it's like, you really only see this small like street, if anything, just this one house. Um, so you're just like, okay, like this is what you're fighting for, but it doesn't ever like stay with it. No, you know, I feel like he's just dressed it onto the next thing. So when Jaime gets the scarab, it, it just kind of happens. Like there's no buildup or real anticipation or, or feeling of it, feeling importance of him of it picking him or getting a sense why I picked him. Cause the scarab has to choose you and you never really get that sense of it. Right? A lot of the, a lot of the superhero elements for me just kind of felt like they were very last minute. I felt like what, what Aniel did, which he did really well was focus on a film that celebrates Latino culture and Latino families and shows representation. I guess that has done really, really well in this movie, but the superhero stuff came so late that it ended up just being the tropes. It ended up just being the fill in the blanks of a Mad Libs that you kind of get. Yeah. You're going to hear the villain. He's going to have a weird connection to the, to the leader. And then you're also going to be like, Oh, that guy's probably going to turn later. Yeah. This guy's going to be important later. And like, you just never really given anything that you could really hold onto. And I think especially how he becomes a leader, which you kind of touched upon there that was, it's so silly that it's like, and it's in the trailer too. When I was like, Oh, there's no way that it's, it's that quick. It really is. It's silly that it's that quick, that it's that inconsequential to the moment that's occurring. That you're like, why was there no emphasis brought onto this? And immediately when, when horrible things happen in this movie, people are very unfazed by them very quickly. They'll kind of just get over it and be like, yeah, it's, it's not really that big of a deal at the moment. We'll get, we'll cry about this later or we'll worry about this later. That's kind of focused on what's happening right now, which I found very inconsistent with tone. And I think what it reminded me a lot of, and I kind of mentioned to you is this movie for better or for worse, reminded me of like a Robert Rodriguez film. I'm talking about like spy kids level where it's just silly spy kids, like three D level spy kids, three D level spy. It's two levels. Spy kids. One is goaded. So you can't even, we can't, we can't insult that film, but there's just levels of, of the silliness that kind of just don't match with the vibe of the film. And then we talk about the melodrama and the movie that you're talking about here. It, it's just so overdone at some points. We haven't even touched on Susan Serman and I'm going to quickly, just quickly touch upon her for a quick second. We'll dive into her in a bit. Okay. She, I know I'm like stabbing you with it. I know, I know. But are you going to talk about her now? I'll wait. No, no, I was just going to say, cause you mentioned the melodrama. Yeah. I mentioned the melodrama. No, no, no. I was just saying like, I just feel like it's so heavy handed. Oh yeah. And I think that's where it's like, there is no genuine emotion that I was feeling. This movie tells you and it's trying so hard to tell you to feel sad. It's like, this is when you need to be sad or this is a cool moment. And I think like you're telling you, you're trying so hard to make me feel a certain way where I just felt nothing watching it in a lot of moments. And I think that's, that's what was so depressing for me. I'm like, this is a superhero movie. Like this is still be like, should have some just, just natural emotions that come out of it, but it feels very manufactured. And it just feels very just written. So many lines of this movie just feel like this was written. There is not a person just saying these things or feeling very AI. It's just very robotic. And you know, for a character with like Blue Beetle, who obviously is being taken over by this alien life form, which is again, it's another thing that they've changed from the, from the, the comic books and from like the animated series where it's like this alien life. It's an alien life. It's an alien life form, but it's like, it was already on earth. So like, and like, there was not really a mention again, like, cause I miss, I didn't hear they're about to reach at all in this movie. I must've missed it. You know? So maybe they said, Oh, I'm going to reach for the scarab over here. They were reaching a lot. There was a lot of, not, not that. Yeah. But I think for me, it's just like, you said, man, like this is like CW level melodrama and some effects as well. There's a lot of, like, if you're an injustice to fan, obviously there's a lot of moves taken right out of that game. But like, there's a lot of practicalness that they've used for the suit, which I respect them for. But then it kind of goes all out the window when he starts flying or starts doing his stuff where it's like, I don't get how, you know, 15 years ago, the flat, sorry, the flash 15 years ago, iron man came out and that movie is still taking everybody to school with having a character who could fly and who could look powerful and look real 15 years ago. And here we are now in 2023 from a movie from 2008 that is still outclassing everyone. And I'm even talking about the MCU when some moments to now that you're just having a movie that just looks so real and blue beetle. Like there's a moment in the movie where he cuts a bus in half, which you leaned over to me like, man, buses just have a good time. No, no buses are just getting cut all the time. Now we have, we have Shung Chi. We have Dr. Strange. Now we have this. I feel like I'm probably missing a few more bus. Yeah. What bus got cut? I think it was straight down the middle and there's a right standing in a bus, even though I've been in a bus many times where people are standing in the middle all the time. That was my life. And I'm, I've, I would have been, I would have been, I would have been, I would have been split into right down the middle. But yeah, it just happens. And there's a moment and I want to touch on it because in other films, I feel like we've gone this very same thing. And you know, Andrew Garfield, Spider-Man films, again, these moments of like having a person inspire another character is great. And having a character look at them and be like, Oh, I could be like this hero too. But this man, Blue Beetle, just, he was discovering his powers and he splits a bus in half. There's nothing hopeful in that moment. I'd be scared shitless if I was that kid. And he looks out the window and it's a little Latino kid and it's nice. It's such a, like a forced nice moment that he's looking, he sees him fly away. And I'm like, Oh, that's the force superhero hope moment. You know, but it's like, he didn't do anything heroic. You just cut your, your ride in half. In fact, he inconvenienced you, you know, and he dipped and I'm like, Oh, like that moment would have played so much better had he done a heroic act. It's just strange that it was just like, I'm going to cut this bus and I'm going to run. There's just a lot of that in this film where you're kind of wondering what, what is the point of this scene? Where are we kind of going with this? You're introducing characters that aren't really that interesting. I don't honestly remember any of the characters names minus obviously Sholo. Yeah. Sholo, Sholo, like being the, the, the big one, uh, there's, there's the movie does not linger on these characters, you know, identities who they are. There's such caricatures of like, Oh, I'm of course related to the villain of this movie. And my dad was, you know, was, you know, I believe my dad is dead and, or like my dad's company was taken over and I don't agree with what you're doing. It's like, these are things we've seen a million times before. And everyone's introduced in a way where it's like, how could you not? It was very like soap opera. Like, how could you not remember me? Like I'm, I've been your granddaughter. I'm your this. And I'm like, it's like, like almost like a novella, right? Like, and I very much, and if that was the point, it's not a good way to do it. No, cause it just feels again, it feels cheesy and like, you know, it just doesn't feel natural. There's nothing natural to it. And like, you could have the nods and the overacting and that would you see a lot, you know, when we have the family, when we have the Reyes family reacting to him having the scarab and then like them blessing themselves and them reacting, like those are funny moments, but it's like, they just almost turn into caricatures of that. And it's, it's too much. You should wonder like, is this a stereotype? Is this actually how it happens? Like there's a lot of different questions that kind of start going through your head where it's like, what is, what is going on this movie? The screenplay feels like it was, it was being made up on the spot and it's, it's very rough. It's very silly. Let's talk a little bit about Susan Serena because she comes in this movie, she's the opening sequence really in this film. And it's such a bad guy, villain comic book movie moment where she's like, I, you guys are running late. I need to know what's going on with this system right now and I need to get this or I need to get this. And it's like, what is going on? And then it cuts to every moment with her and she's just so maniacally evil. It's very obvious that Susan Serena was trying to get her bag. She just, she's like, I haven't done a movie in a while, probably. So let me make some money and then I'll pay off some of my houses and then chill for a bit. Cause it, it literally felt like she did not care what was happening. This movie, she just came in, did a super villain performance from 1993 and then left. Yeah. Susan Sarandon delivers one of the worst comic book villain performances of all time. And I like Susan Sarandon. Oh yeah, me too. But her performance in blue beetle blew me away of just how blue blue beatled me away blue, blue, blue of just how robotic, how desensitized, how withdrawn she is from whatever is that's happening. She's literally like, you, you think of like those YouTube compilations back in the day was it Mortal Kombat 2 was like, but you will die. You know, it's, it's that level. Where she's just like, I'm going to get you. Yeah. You're like, it's, it's really rough. Are we past this? Like, like why, why did we think that Susan was the first of all, the role for this movie, what was it about performance? There's no way that there was a, a call put out or actors audition for this. This was like, oh, we probably have, you know, Susan on a contract. Susan owes WB another film and that's what they did. It's, it's, it's really disappointing because again, she typically, I mean, she's a best actress winner. She's a phenomenal actress. It just, and it's not even the fact that she wasn't giving any anything to do. She really wasn't given a lot to do other than yell these action figure, you know, you know, phrases out, but the way that she did it just felt that she was just so just not interested in what was happening. And when you have a, a hero and a villain who just have no chemistry with one another, and you don't care about their dynamic, and I think that's where I'm at. I wanted to care so much more about blue beetle. I wanted to care about him overcoming, you know, you know, his demons within, you know, the pressure of his family, things like that. But a lot of this movie just felt like this feels like an extended episode of a pilot I'd see on the CW that it has real note. It doesn't have really any depth to it, but at least there I, you would hopefully get a villain that would connect to, you know, the heart or is connected to like the main character in some way. Like this just felt like she's just such a disposable villain that you could have put anyone in those shoes. You could have put any, any random character name and they would have done the exact same thing that, you know, what she service in this movie, which was really nothing special. Yeah, it's, it's silly. It's, it's just the, the CG was really, really rough. I mean, when you have a practical suit that looks great, adding CG elements to it, it stands out immediately and you kind of start to wonder like, what was the point of this? Like stick, stick to a type, stick to a formula that you want to do and the lighting, the, the lightning that comes out of him and just the pacing of the movie also just very, very bizarre. There's just so many scenes of like, well, what is the point of this? You could have cut this out and it wouldn't have changed a single thing. It's cheesy. It's corny. It's really, really bad dialogue. And I wish, I really wish I enjoyed this movie because it was getting great reviews. I'm so confused right now. What was being seen? I'm sure, you know, everyone has a different lens. So people are really enjoying it. And if you are enjoying it and you liked it, let us know what they are. Love about this. Let's talk about it. I am a loss. I don't know what about this movie is the next phase or the next step because again, we've seen it a hundred times before. There's no consequences to certain moments when characters pass or die or anything happens. It's like, I didn't spend enough time with this character to care that they're going. Why should I care right now? And then you, like you said, the force that sadness to you, it's like, no, no, this is a sad moment. You should probably cry. So as you said, as well as I said, as we've said a hundred times on this episode, who said it? We've seen this movie a hundred times before. I want to add something to it. We've seen this movie a hundred times before done better. Yes, we've seen this movie. We've seen this better movie a hundred times before. And that's and that's what's so unfortunate when you have a character who were like, OK, should I be excited about the DC you moving forward? He's the first DCU character. Are we going to should I be looking forward to seeing Blue Beetle pop up again? I mean, I'm not right now. I know this movie gave me nothing to look forward to. If he does pop up again, I'd hope it's done with more justice and more. It's not even a lack of respect for the character, because I don't think it's that at all. This is not like this movie mistreats the character of Jaime. I just feel like it's such a bland story. The story is what's failing here. It's the technical parts of the movie that's failing here that makes it such an unenjoyable watch. Even the score and the sound design so much throughout this film felt like like this just feels like noise. I'm not sure what the what the theme was. I'm not sure what the any anything was in this. You know, there was some there was some bad lighting, bad locations. Yeah. Just and then you have another bad guy in the film as well that, you know, from the beginning, we're like, oh, this is what's going to happen to this character down the road. And it plays out exactly like we expected. The dialogue was delivered exactly like we expected. And it's a character that has barely any lines and you don't remember. And then that last minute they do this montage of this villain, like in the last split second of why he is the way he is the way he is. And it's like, I can't believe someone sat down and wrote this. It feels so first draft. And I looked at the screenplay writer for this film, the last and the only thing that they really done is Miss Bala, Miss Bala. That's the Gene Roderick's film from like 2020. Yes. And I immediately got it. I was like, oh, OK. You know, we were talking yesterday, we were trying to figure out what the Man of Steel reference was. I don't I don't know. They said Superman. That's it. They said Superman. They said the Flash. They said Batman is a fascist, which we have in the trailer, which they have in the trailer. We have I guess there's a similar again, same movie that like they did this, you know, ten years ago in Man of Steel, where the characters kind of like pondering like they need to like get to the next thing and they go to like this otherworldly. Do you think it's like when they see the other person maybe in the. Yeah, I feel like it's like that thing was like, OK, we're going to you. That's like when like so picture Man of Steel when he's being when he's talking to Michael Shannon is odd and he's being like buried in all like the skulls and stuff like that. And there and other I was thinking of the Jonathan Kent moment. Oh, yeah, maybe it could be that that that felt like, OK, maybe that's what this moment is. Maybe. I mean, we're tiptoeing around it. Also that movie. Sorry. That movie really quickly in the same universe, quote unquote, did flying better. Yeah. I mean, a lot of movies. I know. A lot of movies rewind five years before Man of Steel. Iron Man did fly better. Christopher Reeve Superman did flying better. I believed a man could fly in that movie. Yeah. And like again, it goes into that realm of just like just turns it to the CGI, you know, gobbledygook. That's just gobbledygook. Gobbledygook. Just like, oh, just like a blob flying like you don't there's no tangible feeling to it. Like you never feel that connection to it. There's no weight in this movie. There's no actual relationships in this movie you care about. The comedy works sometimes, but at the same time, it just feels like I know what the next joke is going to be. Or it's literally we have like the equivalent of a joke where a character goes to the washroom like, oh, don't go in there. And it's like slapstick humor. It's just like, oh, hanging fruit. Okay. Like, sure. Like that's what you want to do. But again, like when you, when you, I always think of something like you have the DC logo on this. Like this is the studio that made the dark night. This is the studio that gave us, you know, the Batman last year. This is the studio that gave us a Wonder Woman, the studio that gave us Joker. Yeah. Like, like it's just, it's just like, okay, like I'm, I'm excited to see what Superman legacy can be. But right now, and I'm nervous and I know James Gunn really didn't have anything to do with this movie, but I'm also at that point where I'm like, I'm not excited for anything DC right now, other than the Batman part two Joker two, cause at least I know what to expect with the Joker two more, more or less. We there's a prestige from the first one. Right. Right. And then the thing over like, you know, this is like an other, this is not part of all of that, that we're doing stuff on our own. And as of right now, blue beetle feels like it's on its own. And if you're watching this in theaters this weekend, you may be on your own because we are, because we just checked seats and that's what I mean. Like if you go see it in the theaters this week, we can, you may be on your own because we're seeing prime times opening night opening weekend and we're seeing in giant auditoriums in IMAX theaters that had to give up major cities that had to give up Oppenheimer, like luckily Oppenheimer still playing on the majority of them, but it's like, you're seeing like three, four seats sold and it's like, this is not good. And I think in a year where Warner brothers and, and DC have been getting their butts kicked sadly that here we are again and we're having the same discussion and what's going to happen now come December is Aquaman even to come out. James Gunn has a huge, huge, huge chip on his shoulder right now. Yeah. We're obstacle to overcome with what's coming next and not only making good movie because again, it doesn't matter if you make a good movie or not. The suicide squad was one of my favorite movies of 2021. I adore that movie. I think it's one of the best films of the year. One of the best superhero movies of the year. Because the suicide squad at that moment was my favorite DC movie since the dark night. And people joke about that term. Oh, it's the best movie since dark night. It is. It is the best movie that I think DC has put out since the dark night, the James Gunn suicide squad. That movie didn't make money at the box office. There are no guarantees in, in Hollywood anymore. Mission Impossible is underperforming Indiana Jones, the flash, the greatest superhero movie that it was ever going to come out. Bombed so hard. And one of the biggest problems of all time, making a good movie isn't good enough. And when you make a bad movie, then there's a lot less hope there. You can't rely on just representation to drive your film forward. I'm grateful that this film has a presentation. I'm a champion for it, but that's not enough to drive this movie forward. You need to have a good story. You need to have something that people aren't seeing anymore. And the thing is, this is not something people have seen before, but they've seen it done better. I mean, it's, it's, it's, it was rough. I was getting impatient during the film. We were debating even sticking around for the after credits because we knew what it was going to be. And again, we knew because we guessed it. Nothing is, nothing is hidden in this film. Everything is laid out very, very easily. Right. It's, I think, I think it's just safe to say, let's get to our final recommendations. Yeah, let's do it. Yeah, please go ahead, Daniel. Blue Beetle is unfortunately, uh, it's a skip it for me. I think this is a movie that you don't need to spend your time on. This is a movie that even when it comes to home release, that you're not going to be thinking about or looking at, uh, you know, learning more about it's unfortunate because I think blue beetle is such a wonderful character in the comic books. If you want to learn more about blue beetle, go read comic books, go check out young justice. Cause I think that's where you're going to get a really rich version of who Jaime Reyes can be blue beetle for me. And obviously for Shay, it didn't do it. Skip it. I was going to say it's a real gem. Wow. Really awkward now. Surprise of what we were talking about the last 30 minutes. I when I don't like a movie is when I give it the highest regard. No, I, you know what? It's unfortunate because I loved having this chat with, with Aniel, Emmanuel Soto. He's clearly very passionate about his community. He's clearly passionate about making movies. I think blue beetle as a character might not have been the best way to, for him to start. I think he has a great story. I think he was going to tell some great films about the Latino community, but his blue beetle wasn't that movie for us at all. It is a major skip it. I don't think really anyone's going to be watching this movie. And if you do, if you do end up watching this movie, let us know, join our discord, uh, Remus on the comments. Um, but yeah, we're here to have a safe discussion. We're having a good discussion because again, we want movies to succeed and it's so unfortunate when a movie does not hit a mark at all. Of course, if you want to continue the conversation, like I said, discord is available, but we also are available on every other social media platform out there. We're on Twitter, X-con give it to you. We're on Instagram, we're on YouTube, we're on everywhere and tick tock and tick tock of course, as well. Make sure to follow us on there. We're dropping some great videos, great interviews. There's a lot more coming. We're getting closer and closer to the Toronto international film festival. If you know what that is, you know, movies going to come out. It's going to be looking a little different this year, obviously with the strikes. So stay tuned for more information about that. Of course, that was this time with the movie podcast. We'll see you next."}, "podcast_summary": "In this episode of the movie podcast, the hosts discuss their thoughts on the film Blue Beetle. They mention that while they are honest in their criticism, they strive to be fair and not unnecessarily negative. They acknowledge the importance of building a community of movie lovers and encourage viewers to join the conversation. They express disappointment with the film, noting that it relies on tired tropes and fails to bring anything new to the genre. They criticize the character development, dialogue, and technical aspects of the film, such as the CGI and sound design. They point out the lack of chemistry between the hero and villain and the overall lack of depth in the story. Despite the film's focus on Latino culture and representation, they feel that it falls short in delivering a compelling and original superhero movie. They conclude that Blue Beetle is a skip-it and recommend reading the comics or checking out other movies and shows that feature the character instead.", "podcast_guest": "Blue Beetle is the name of three fictional superheroes appearing in a number of American comic books published by a variety of companies since 1939. The most recent of the companies to own rights to Blue Beetle is DC Comics, which bought the rights to the character in 1983, using the name for three distinct characters over the years.\nThe original Blue Beetle was created by Charles Nicholas Wojtkoski and Fox Comics and later owned by Charlton Comics. The first Beetle was Dan Garret (later spelled Dan Garrett), who initially gained superpowers from a special vitamin, which was later changed to gaining powers from a \"sacred scarab\". The original Blue Beetle was featured in not only his own comic but also a weekly radio serial.\nThe second Blue Beetle, created by Charlton and later taken over by DC Comics, was the successor to Dan Garrett known as Ted Kord. Kord \"jumped\" to the DC Comics universe during the Crisis on Infinite Earths alongside a number of other Charlton Comics characters. The second Blue Beetle later starred in his own 24-issue comic. Kord never had any super powers but used science to create various devices to help him fight crime. He became a member of the Justice League of America and was later killed during the prelude to DC Comics' Infinite Crisis cross over.\nThe third Blue Beetle, created by DC Comics, is Jaime Reyes, a teenager who discovers that the original Blue Beetle scarab morphs into a battle suit allowing him to fight crime and travel in space. Over the years, Reyes became a member of the Teen Titans and starred in two Blue Beetle comic series. In DC Comics' 2011 \"New 52\" reboot, Jaime Reyes was the primary Blue Beetle character, only occasionally referring to past versions. With the subsequent continuity revision \"DC Rebirth\", the previous versions were restored.\n\n", "podcast_highlights": "In the podcast review of Blue Beetle, the hosts and guests discuss their thoughts on the film. They touch on several topics, including the portrayal of the Reyes family and the representation of Latino culture. They also critique the movie's story, characters, and dialogue, noting its reliance on cliches and lack of originality. The hosts express disappointment with the film's overall execution and feel that it falls short of its potential. The discussion highlights the need for fresh and innovative storytelling in superhero movies and raises questions about the future of the DC universe. Overall, the hosts and guests agree that Blue Beetle is not worth watching and recommend skipping it."}