{"podcast_details": {"podcast_title": "Thirst Gap: Learning to Live with Less on the Colorado River", "episode_title": "Where the River Ends", "episode_image": "https://images.transistor.fm/file/transistor/images/show/40550/full_1680815931-artwork.jpg", "episode_transcript": " Thirst Gap, Learning to Live with Less on the Colorado River, is a production of KUNC with support from the Colorado Water Center and the Colorado State University Office of Engagement and Extension. The Colorado River comes to an end about 100 miles short of the Pacific Ocean. Downstream of Hoover Dam, the river is like a piece of yarn frayed at one end, split into many strands heading in different directions. Canals transport its waters to far-off cities and sprawling farm fields until just a narrow stream hits the U.S.-Mexico border. One final dam diverts the rest of the water into Mexico. It makes a hard jog to the west to irrigate farm fields and flow through faucets as far away as Tijuana. If there's one thing people know about the Colorado River, it's that it doesn't do what other rivers in the world do. It no longer reaches the ocean. Its journey from the Rocky Mountains to the Pacific is cut short. But it wasn't always this way. When the nature writer Aldo Leopold took a canoe trip with his brother through the Colorado River Delta in 1922, he called it a land of green lagoons. In his book, A Sand County Almanac, Leopold paints a picture of an estuary teeming with life, with jaguars, bobcats, raccoons, cormorants, and quails. When Leopold visited, the water spread so wide across the flat delta that he wrote the river was, quote, everywhere and nowhere. The men watched as flocks of birds came in to feast. There were so many egrets, he wrote, that it looked like an approaching snowstorm. The Colorado River's delta was dewatered over the span of decades. And as the water disappeared, much of the wildlife did too. And yet, over the last 10 years or so, enough powerful people realized the mistake we made. Water is slowly returning to some portions of the dry riverbed in Mexico. It's a story about collaboration between two countries to rethink what we ask of the river. It's a lesson in how difficult it is to give water back to the environment once it's been taken away. From KUNC, this is Thirst Gap, learning to live with less on the Colorado River. I'm Luke Runyon. This is episode 6, Where the River Ends. This summer, I made the trip to the Colorado River Delta in Mexico. The delta is the spot where the river and the ocean, the salt water, and the freshwater would meet. I was with my friend, Elliot Ross, about a two hour drive south of Mexicali. And it was almost impossible to imagine that this was the same place Aldo Leopold described as lush and green. So this would have been part of the estuary. This would have been wet. Yeah, this would have been. Basically from those mountains over there to the far end, near where the Cienega is, that would have all been kind of considered the Colorado River Delta. Elliot and I traveled to witness a brief reconnection between a portion of the Colorado River in its delta and the ocean. Elliot is a photographer, and we both share a fascination with the West's rivers. As we drove through the dried out delta, our rental car's tires spit out giant plumes of dust. We passed these eerie looking ponds with red colored water and white salt crust around them. Multi colored salt pools mixed with dead vegetation about head height. As far as I can see, crazy. Forests of dead mesquite trees in Tamarisk ran for miles. Elliot said it smelled like death. We came to meet the scientists and environmental advocates working in this area, people who are studying the delta so they can understand what it'll take to bring it back to some semblance of its former self. People like Tomas Rivas. I'm a marine biologist and a restoration specialist in Sonoran Institute. And can you say where we are right now? Right now we are here in the Colorado River Delta estuary. It's where the river and the sea mix when the conditions are the right one. Tomas was in a pair of muck boots and a wide brimmed hat, the uniform necessary to trudge through this muddy delta and avoid the relentless sun. Temperatures can easily surpass 120 degrees here in summer. Today was milder, only about 100 outside with a stiff wind. As we spoke, the tide began to come in, spreading across the barren mudflats. This area is more dominated by seawater. Science says this is an inverse or negative estuary because it's dominated by salt water or seawater more than fresh water. The salt water from the rising tide dominates because we've essentially removed all the fresh water from the equation. All of our demands on the Colorado River have stretched the definition of the word estuary here. An estuary is supposed to be the place where freshwater rivers and salt water oceans mix. They're havens of biodiversity, and the Colorado's estuary used to be the sprawling network of wetlands Leopold wrote about. But that just doesn't exist here in the way that it did before humans came along and dammed the river. Yeah, so I think the conditions make this place unique and also all the changing elements here in the estuary. You have the higher temperatures, a lot of evaporation, there are little fresh water, the tides enters frequently but not enough to inundate all the area. I would love to have been here 100 years ago where you would probably see a huge river flowing into a beautiful ocean, a beautiful sea like the Sea of Cortez. Aida Navarro runs Raise the River or Alianza Revive el Rio Colorado. It's a coalition of environmental groups on both sides of the border with the goal of bringing the river back here to help this estuary actually live up to its name. Just upstream of where we were talking, a relatively small amount of water was spilling back into the river channel and making its way down here to the estuary. This very brief reconnection between the river and the ocean was made possible because of work her coalition has done. So I don't know, I think it's inspiring. Because usually when you see a place like this, you would think like, okay, all is lost. Let's go someplace else, right? The inspiring part to her is how the two countries that rely on the Colorado River, the US and Mexico have for the past 10 years agreed that the environment here is deserving of some water. This is an example worldwide about how a shared basin can be shared and how they call when people get married for better or for worse or good and bad. When there's abundance of water, we will share it. When there's scarcity of water, we will share. On the scarcity, we will share on the shortages. And it's the first example in the world where the environment has had a voice because in the past it's water for humans, whether it's the cities, agriculture, swimming pools, Vegas, you name it. But what about the environment, right? This marriage between the US and Mexico on river issues goes back to 1944. That's when the two countries signed a treaty and agreed to set aside a certain amount of the river's water for use in Mexico. Today much of Mexico's Colorado River water goes to agriculture in the Mexicali Valley and flows to cities like Tijuana, Tecate, and Mexicali. After the 1944 treaty was signed, the two countries came back together every now and then, mostly to tackle issues of water quality. But really they kept each other at arm's length when it came to the river's management. Until 2010, when a natural disaster brought them closer together. The quake was so powerful, people felt it more than 300 miles away in Las Vegas. That was the scariest thing I've ever experienced. The most severe damage is south of the border. Mexicali, Mexico is just 19 miles from the epicenter. A massive earthquake upended irrigation canals in Mexico. So in an unprecedented move, the country asked to store its water in American reservoirs. And four years later, environmental groups on both sides of the border pushed for some of that stored water to be set aside for an experiment. To see what happens when water returns to an area where it's been absent for decades. Mexico is releasing part of its river allotment for eight weeks. The first time ever that water has been released to benefit the environment. It's called a pulse flow because it mimics a spring flood. A one-time event done this year before possible drought restrictions. Visually and emotionally it was beautiful. I mean, just to see all this water flowing for the first time in decades or years. It was a spectacle. A wave of water spilled into the dry riverbed. People from the nearby city, San Luis Rio, Colorado came to see the river flow again. Spontaneous festivals popped up. When I visited a few years after it had happened, a local resident I talked to compared the pulse flow to the return of a long lost friend. Aida says it was joyous. But that water didn't necessarily reach the places that we wanted it to. I mean, it was a good experiment. But it was a good experience to learn that a lot of water did get lost or evaporated or went into the ground. Because portions of the delta have been dried out for so long, there are reaches of the river channel where the pulse flow just got absorbed like a sponge. Environmentalists are careful to say that this wasn't wasted water. It just didn't do as much ecological good as it could have if it had been used more wisely. So Aida says after that event, environmental groups went back to the drawing board, asked for more water from the U.S. and Mexico over a longer period of time. And they would use it more methodically to restore the river channel. And they got it. The two countries agreed to set aside water for the environment in 2017. We're saying let's send the water where we need it, where it's going to be more beneficial. Let's send those droplets to the specific plants that we want to hydrate. But with all the pressures on the Colorado River to water crops in both the U.S. and Mexico to flow through faucets in some of America's biggest cities, Aida says it's been a challenge to make a case to people in power that some of that water should be set aside just to benefit the environment. I mean, if you compare to the whole Colorado River basin, the amount of water that we're putting into an environment, it's nothing. It's a drop of water. It's less than that. So I mean, it's easy for people who don't really understand to make a case against, like why are you just spilling the water, right? And she says as those pressures increase, both countries cannot afford to sacrifice the environment. The current agreement between the two countries only lasts for another three years. Beyond that, there's no guarantee restoration work will keep happening here. We're like the last front of fight against climate change and we have to prove that we can make these ecosystems resilient again. How do you go about making the Delta resilient again? That's coming up after the break. First Gap is sponsored by the Colorado Water Center, leading research, education, and outreach to address water related challenges in Colorado and beyond. Building collaborations between communities, scientists, educators, and policymakers to ensure clean and reliable water. And by CSU's Office of Engagement and Extension, serving Colorado through community partnerships, outreach programs, and extension offices, offering educational resources and lifelong learning opportunities online and in person, csuenengage.com. The Colorado Dream podcast from KUNC examines how today's biggest social issues impact our local communities. From a changing workforce, we know that not every student coming through the doors wants that traditional pathway to immigration. We have a new face of the city. And coming soon, we dig into the state's housing crisis. No one can plan housing at the moment. The Colorado Dream returns this fall with a brand new season. Catch up on seasons one and two, wherever you get your podcasts. This is where we're going, right? Upstream of the estuary sits a tiny oasis. There's water spilling out of a canal down into this narrow concrete channel over these cobblestones and into this restoration site called Chausay. This is one of a handful of restoration areas in the Colorado River's historic channel in Mexico, established in the last several years. It's a place that used to be dry and where water is returning. There's mesquite trees and cottonwoods lining the river channel. It's beautiful and it feels wet. The air feels moist, which is so rare here. The first person I meet at the site is Ricardo Escobedo, who immediately pulls out his phone to show me pictures of beavers. There are whole beaver families that have taken up residence here. One time while he was working, he saw a small furry thing scurrying around, thought it was a mouse. But no, it was a baby beaver. And they've been multiplying here ever since. Ricardo runs the irrigation system at this restoration site, about a 40 minute drive from the border. And let me explain how this place works. So this area is where the Colorado River used to flow. As a part of the agreement between the US and Mexico, water is delivered here through Mexico's irrigation canals. That's the water that's pouring into this site as we're talking. Once a month, workers like Ricardo spill water into this site and then use irrigation techniques to move it around to water trees. In some sense, they're using farming techniques to regrow habitat instead of crops. In front of us is a giant green pond surrounded by trees. And because it's 100 degrees out, the shade is heavenly. Aida helped to translate. Do you feel optimistic about the future of this site, this place? He says he's proud of this place. Many of these trees he planted with his own two hands. He calls them his babies, arbolitos. And even though this site is one tiny green island in a massive dried out delta, he says it's important. I think all the points that can be found on some map have some importance or relevance. From my knowledge and what I have working here at Restoremos, I've realized that we're building small hotels or rest areas for the birds that come here. Many birds land on the water here and build what Ricardo calls little bird hotels, hoteles pequeños in the trees. This oasis allows them to rest and refresh on their journey from South America to the north. When the flood stopped in the river, they had nowhere to rest. Ricardo is glad that this spot has become a place for birds to stop. Imagine taking a road trip and not stopping to go to the bathroom or fill up the tank, he says. You probably wouldn't make it very far. And that's what this site gives birds. This is just one of a handful of sites that have popped up along the river channel in Mexico since the last agreement between the two countries was signed. Ricardo says this site shows how much benefit there is to the environment when you set aside even just a small amount of water. The impact at Chao Se is even more impressive when you think about how two countries that at many times are at odds with one another came together to make it happen. You know, I look around the world for another border that joins two countries that are so dissimilar and you're hard pressed to find it. Carlos de la Parra is an urban studies professor at Colegio de la Frontera Norte in Tijuana. Carlos has been a part of binational negotiations to make these restoration sites happen. He says he still hears pushback from Mexican farmers and city leaders. And people are pissed. I mean, there are voices out there that are saying stop this. Because why? Because you are wasting water. Water isn't partisan, Carlos says. The way people feel about what's wasted water and what isn't depends on your relationship to it. A farmer in the Mexicali Valley might look suspiciously toward water flowing for the environment, especially as supplies tighten for farmers on both sides of the border. A city leader having to mandate conservation could see that water set aside for the environment and think it would be better used to build more homes, to spur on the local economy. What Carlos says is that water for the environment cannot be framed as an either or proposition. Throughout the world, two countries agreeing to share water to the benefit of their shared ecosystem has never happened. Never. Dividing the waters between two countries and international rivers are for the purpose of economic development or just simply sharing the waters or agriculture. But never had it happened that two countries would decide, Jesus Christ, our shared ecosystem needs the water. Not putting water into the river should no longer be an option. Again, raised the rivers Aida Navarro. We must continue this because it's kind of showing that the mistake of taking water from the river many years ago, I mean, that was probably the mistake, right? I mean, it's great that all this water has been used for human consumption, for whatever industries, cities, et cetera, but we cannot afford to let this ecosystem die. We cannot afford to let a river die. We've made our way here, the last stop on our journey down the Colorado River, starting at its headwaters high up in the mountains and ending here at the U.S.-Mexico border. At each stop along the way, we've explored the tensions, the tradeoffs that exist as the region grapples with water scarcity. We've met farmers concerned for their livelihoods and their tie to the land. My passion is to see my son keep farming, maybe see my grandson or granddaughter keep farming. Boaters worried about their favorite places drying up. This is different. This is feeling like we really could stop Lake Powell as we know it. Environmentalists decrying the loss of wildlife habitats. We know as a species react until it's like, oh man, we need to do something. And we're getting to the point where people are saying, man, we need to do something. People in cities growing anxious about limits to their use. We're a city, a large city, placed in a precarious place where we depend upon that Colorado River to survive. And so we've got to do our part. And tribal leaders calling for all of us to acknowledge past and present wrongs when it comes to the West's water. I think with the Colorado River basin, the challenge is that many people think that things are etched in stone. We saw that in the farm fields of Colorado, at Lake Powell, on the Navajo Nation, in Las Vegas neighborhoods. Wishful thinking about what the Colorado River was capable of got us into this mess. What we have control over as a society is how much we choose to rely on it. This is where things stand currently. We don't have enough water to meet everyone's needs. But deciding who should bear the burden of water scarcity, what's fair, what's right, what's just, we're still figuring that out. Everyone agrees the river cannot provide what we ask of it. And bringing it into balance, closing the gap between supply and demand, will mean everyone, every sector of our economy, every person who relies on this river will need to learn to live with less. Thirst Gap is a production of KUNC, brought to you by the Colorado Water Center and the Colorado State University Office of Engagement and Extension, with additional support from the Walton Family Foundation and the Water Desk at the University of Colorado Boulder. It was written and reported by me, Luke Runyon, editing by Johanna Zorn. Our theme song was composed by Jason Patton, who also sound designed and mixed the episode. Ashley Jeffcoat, Jennifer Coombs, and Natalie Scolland are our digital editors. Sean Corcoran is KUNC's news director. Tammy Turwell is KUNC's president and CEO. Special thanks to Alex Hager, Elliot Ross, Stephanie Daniel, Desmond O'Boyle, Robert Leja, Kim Race, and Jen Proll. To learn more about the Colorado River, go to kunc.org slash thirst gap or check out the show notes for a link."}, "podcast_summary": "In the podcast \"Thirst Gap: Learning to Live with Less on the Colorado River,\" the focus is on the challenges facing the Colorado River and its delta. The host, Luke Runyon, takes listeners on a journey through the history and current state of the river, highlighting the environmental damage caused by human intervention. The podcast explores how powerful collaboration between the US and Mexico is slowly bringing water back to the depleted riverbed, and the efforts being made to restore the delta's ecosystem. The main takeaway is that while the Colorado River can no longer meet the demands placed on it, there is hope for its restoration. Through the shared commitment of both countries, a small amount of water is being set aside to benefit the environment. The podcast emphasizes the importance of preserving the river and finding a balance between human needs and environmental conservation. It serves as a reminder that we must learn to live with less and make sustainable choices to protect this vital natural resource.", "podcast_guest": {"name": "Luke Runyon", "org": "", "title": "", "summary": "Could not find detailed information about Luke Runyon on Wikipedia. However, you can learn more about the guest here: https://www.linkedin.com/in/luke-runyon-8872b720"}, "podcast_highlights": "1. Opinions that might create more discussion in the audience include the need to prioritize water allocation for the environment, the challenge of convincing people in power to set aside water for the environment, and the importance of collaboration between the US and Mexico to restore the Colorado River Delta.\n\n2. Keynotes from the podcast transcript:\n- The Colorado River's delta was dewatered over the span of decades, causing the loss of wildlife and vegetation.\n- Over the last 10 years, efforts have been made to return water to the dry riverbed in Mexico.\n- Collaboration between the US and Mexico has allowed for the reconnection of a portion of the Colorado River to the ocean.\n- Environmental groups have worked to restore the river channel and create habitats for wildlife.\n- The challenge lies in convincing people in power that water should be set aside for the environment.\n- The agreement between the two countries to allocate water for the environment only lasts for three more years.\n- Everyone agrees that the Colorado River cannot meet everyone's needs and that living with less water is necessary."}