{"podcast_details": {"podcast_title": "The Book Review", "episode_title": "Amor Towles Sees Dead People", "episode_image": "https://image.simplecastcdn.com/images/621229bd-2556-4ce6-8ae0-9fa3046f9da9/1e9abcf9-af9c-4105-8b1b-8e05c60c1fcf/3000x3000/8ce0200f165a6c5cafeecc11ac3294f228d9e46d8af6079a5a9db0fe3b62c8fe48ee2dbb6b2460bf705631e82a06b6b79e940141aad774c868833e2a204ce41b.jpeg?aid=rss_feed", "episode_transcript": " This is the Book Review Podcast, and I'm Gilbert Cruz, editor of the New York Times Book Review. We'll be taking a few weeks off here in late summer in order to plan some exciting episodes for the fall book season, those months when big books hit shelves in rapid succession. This week, though, we have a special treat, a double interview show for you. First, I'll be speaking to Amor Tolles, author of the bestselling books Rules of Civility, A Gentleman in Moscow, and The Lincoln Highway. We recently ran a very fun essay by Amor that looks at the history of crime fiction through the very particular perspective of the long-suffering corpse, cadaver, victim. Then, after the break, Sarah Lyle, a regular guest here on the podcast and the Book Review's thriller columnist, has a beautiful conversation with the actor Richard E. Grant. He first talks about his new memoir, A Pocketful of Happiness, and then, as part of a recurring segment here on the podcast, discusses the book he has read most in his life, Lewis Carroll's Alice's Adventures in Wonderland. First, though, here's my conversation with bestselling author Amor Tolles. Amor Tolles, welcome to the Book Review Podcast. Thank you for having me. It's great to be here. Your recent piece in the Book Review's thriller issue is adapted from your introduction to The Mysterious Bookshop Presents, the best mystery stories of the year 2023, which is going to be published in September. I would love to know how this works, because I've seen The Mysterious Bookshop put out a ton of big collections. You always get your best essays of the year, books like that. How does it work? Are you presented with a pile of mystery stories that you then have to diligently flip through to start? Well, to start, but for the listener's benefit, The Mysterious Bookshop is a many decades old bookstore in Manhattan that does only mystery and suspense. That's what its focus is. Going back 50 years ago, that was very common in the city. There were multiple bookstores in Manhattan for children's writing, for travel writing, for cookbooks, for socialist and communist writing. There were bookstores of all kinds in Manhattan. I think at the peak, there were more than five mystery bookstops in Manhattan. And Otto Penzler's Mysterious Bookshop is really the last man standing, as it were. And Otto's been running the store for decades and going back to really the beginning of the modern era of mystery and suspense. So all of the great contemporary writers know him, have read at the store, have started their careers through his sponsorship. So it's a terrific place. I was there a few weeks ago and Michael Connolly was there in essence to come pay his respects to Otto because Connolly himself would say that Otto was one of the first champions of his work. Lee Childs, the Jack Reacher creator, says the same thing. And so it's very common to hear that from the big players in the field. So anyway, so I'm not a mystery writer, as most listeners may know. I write narrative fiction and in the literary style. But for my novel, A Gentleman in Moscow, Otto really loved the book. And so he included it in his first editions club the year that it came out. And that's how I met him. And so he reached me out of the blue and said, I know that you're a lover of mystery and suspense. Even though you don't write in the genre typically, would you be willing to edit this collection of ours? And that we do. And I was thrilled. I love doing it. So in answer to your specific question, yes, what you end up doing is getting a pile of short stories published in all kinds of mystery and suspense journals of a variety of kinds. In some of these cases, you get the entire stack and you make the entire selection. In this case, it's really a partnership. Otto is going to make half the selections. I'm going to make half the selections. We've done that already. And then I then write the essay at the front of the book. When it comes to mystery fiction, there are many highways and byways, different traditions, different countries, different sub genres. But your essay traces a line through the golden age of detective fiction, Agatha Christie and like Dorothy Sayers through hard boiled detective stories, Hammett, Chandler, and then to the more explicitly violent tales of the late 20th century, largely focused around the rise of serial killers as the villain. And through that change over time, you talk about how the corpse, the cadaver, the victim has also changed in meaning and the way in which it is used in which these stories. Could you talk a little bit about that? Sure. When I was asked to write the essay, I was wondering what am I going to write about? But I have read through the history of mystery and suspense. And as I was dwelling over who I admired, my favorite writers and the different sort of aspects of how the genre has evolved decade to decade, it occurred to me that one of the roles that has changed most dramatically from the beginning of mystery writing in the early 20th century to the present is the role of the cadaver, the dead body, the victim. Because if you go back and read the works of Agatha Christie and her peers, the victim is very much at the center of the story. The body, when it's discovered as Hercule Poirot, Agatha Christie's detective would say, it's the psychology of the victim that is paramount because it's through understanding the victim's personality there, whether they were greedy, whether they were lascivious, whether they were violent or brutal or mean to their children, you have to understand that psychology ultimately to figure out who at the manor, whether it was the maid or the vicar or the stepson, to understand who at the manor that weekend bludgeoned the old fellow over the head, you had to understand what he was like or she was like. And so the personality and the background of the victim was throughout the story. You start with the body, in essence launches the mystery, but you continue to dwell on who is the victim and what were they like and why would somebody want to end their life in such a brutal fashion. But when we shift to the hardboiled detective genre, started really with by Hammett and then refined by Chandler, maybe mastered in many ways by Ross McDonald with his detective Lou Archer, what you start to find is that the body is no longer at the front or even the center of the story because the detectives of the hardboiled era were not murder mystery solvers in the way that Mrs. Marple or Hercule Poirot, they were day labors in essence. They were hired by somebody to do something, not to solve a murder. And the things that they were hired to do were messy personal affairs, tracking down a runaway daughter or recovering a stolen item or investigating a potential infidelity. These are the things that the detectives would be pursuing. Inevitably in the genre, what would happen is somewhere along the way they might talk to some shady character, a guy working at a hotel or a two bit lawyer or an old fading journalist, excuse me. You pointed at me. Sorry. But they would talk to them and information gathering information in this sort of day to day process. And they come back, say a week later or a few days later to ask a follow up question and they find that person had been murdered. And so suddenly, the body in the story is not this center point, the owner of the house, who everybody knows. It's this side character, someone who has been murdered because that individual knew something or was playing some game on the side and therefore had to be silenced. And that was this great moment because the hardball detective suddenly realizes having been going down one dead end after another that, oh, wait a second, I am on the right track and something bigger and messier is here than what I started investigating. This is not simply about finding a daughter or recovering an object. There is some serious evil at play under the surface here. So that kind of lasts then for decades and defines really the mystery genre in the United States. And then you do work up to this modern era of the Scandinavian writers really master it. But we see it in the long form television of things like the bridge or we see it in film like in Silence of the Lambs or Seven, where suddenly the interest is in catching a serial killer. And now the body, which has fallen down the stairs a little bit in terms of their reputation, having been the center of the story with Agatha Christie and this two bit player, but still pretty important in launching affairs in the hard boiled era. By the time you get to serial killers, they are just a prop because there's eight bodies and they all is the manner and the behavior and the process that the serial killer follows that ultimately interest the detective. The detective is trying to match wits with this hyper intelligent individual who can kill people at will and get away with it, it seems. And so the body then becomes this little sort of ignore things and also being treated worse than ever before. You know, one of the things you write about is not only is the body have to undergo such terrible things at the hands of a serial killer, but it's also it is a way in which we put ourselves into the role of the body because many times the victim in these books are just regular people who happen to cross the paths of a very terrible person. That's exactly right. And that's a big difference from the earlier era where we wouldn't imagine ourselves. We don't put ourselves in the position of a victim in Agatha Christie because that person is being killed for a very specific reason because of their background and something they've done and the will. Yeah, exactly. But then we get to the serial killer. And the point is, it could be any of us. It's someone getting in their car late at night and the victim is chosen almost at random and that apparently at random, of course, there's some sort of design behind it, which the detective has to investigate and ultimately understand to capture the murderer. But the victim really is just chosen at random and fills the part of the obsession of the killer, which is some of the ultimate humiliation in a way. A few years ago, you did our By the Book series and you say my discovery of reading as a consuming pleasure began with the Hardy Boys. And I wonder if you would characterize that as one of your earliest memories of reading mystery fiction. Oh, yeah, because it's really one of my earliest memories of reading in that obsessive way, where when you finish a book and you want to read the next one and you want to follow whatever the characters are doing. And the Hardy Boys was that for me. And I remember the summer where I was basically sending my father to the bookstore every day. He would go into town to work and I would say, I'm done. I finished it. And he'd be like, what? And I say, yeah, you got to give me the next one. And don't make sure it's number five, because I just read number four. I don't want number six. You know, and we drive him crazy. But and I obsessively read through the series that summer. And that kind of opened the doors into that that passion for wanting to get back to your chair and read through the book that that defined much of my life actually since then. But it did begin with mystery. And Agatha Christie was a pretty early one for me, too. My father was an Agatha Christie fan. So in high school, we traveled and he was he was a Earl Stanley Gardner fan. He had all the yellowed paperbacks of the Perry Mason mysteries. He was a Rex Stout fan, all the Nero wolf mysteries. And when we went on vacation, he would throw four into his into his suitcase to read one on the plane on the way out, one on the beach, one on the plane on the way home. And then they would start to be handed throughout the rest of us. And we all became kind of fans of those writers at the time. Would you say that you picked up an enthusiasm for reading in general from your father? Was it shared by everyone in the family? We did have a house that that read. My father was probably the bigger reader relative to say my my mother or my siblings. But it also it's one of those things where I knew I wanted to be a writer in first grade. And it wasn't a member of my family. The prompt of that it was that a poet came to my first grade class, read from his work, a poet named David McCord, who wrote poetry for the young. And I just remember being that's the coolest. That was the coolest thing to see this guy who had written these poems to read them. They're in books. He could sign them at the end of class. And from that point forward, that's what I wanted to do. And then it was always I began writing poems like him at that right immediately. And from then on, it was read, write, repeat. You go and read Ray Bradbury and you try to write a science fiction story. You go read Perry Mason, you try to read a write a crime story and work your way through ultimately through literature and pursuing that as a realm in which to operate. We're going to return to questions about mystery fiction. But I do want to ask you a little bit about this thing because in 2011 you released Rules of Civility and you've had a pretty extraordinary run since then. It's followed by Gentlemen of Moscow and the Lincoln Highway. As you say, you always wanted to be a writer. You studied writing as a university student, but you did have this whole other career before becoming a published novelist. What has it been like having this professional life in two parts? I wouldn't change it in the way it unfolded. Science fiction was what I always have wanted to do. And when I found myself in the investment business as a pretty young person, about 25 in a small firm, I really set aside writing for a decade. And there's a lot of anxiety during that phase. My job was terrific. I love my clients and our process and my colleagues. And we had a lot of fun. It was very rewarding in a variety of ways. But throughout that, as we were building the firm, there was this anxiety about if I don't get back and write, eventually I'm going to really be, I'm going to hate myself. I'll be depressed and miserable and a terrible company. I did begin then going back and writing on the weekends after I'd been in the firm for a decade. I spent seven years writing a book I didn't like and set that aside. I learned a lot from that process because I had written many stories by that time, but I had never written a novel and it is a different animal. Then I wrote Rules of Civility. And then when that became a bestseller, I retired from the firm. And I think that in retrospect, for me, that worked out in that by the time I was writing Rules of Civility, virtually none of my contemporary friends even knew I was an aspiring writer. Because when you're an aspiring artist and you're not making art, you don't talk about it because it's painful. Just keep it to yourself. And so years go by and suddenly nobody knows it's even something that you care to do. And I had a job, so I didn't have to write to earn income. Nobody knew I was a writer, so my personality wasn't built in my ego and how I was identified by others wasn't wrapped up in it. Certainly no other writers in New York knew I was interested in writing. So you didn't have any kind of competitive dynamic. So it really meant that at that point I could write for myself and for nobody else and choose the topic, the style. Every aspect of the book could grow out of my own personal fascination with the project. That was very liberating in a way. And I don't think I would have felt that way if I had been writing that book at the age of 25 and it was my sole profession at the time. What did it feel like, if you can recall, to go into bookstores? Was it fuel? Was it were you jealous? Did it stress you out? Could you see your book on the shelf there in the T section? It was all those things, and especially the second and the third, the jealous and frustrating parts. Of course, I loved bookstores. And at the time when I was in New York in the late 80s, there were still a lot of used bookstores around. And so you would go and browse those. And I loved The Strand. Eventually, McNally Jackson came. I love that too. And I even, Barnes & Noble at Union Square was great, a sort of gathering spot. And so I love being in the stores, but it was painful in many ways. You kind of look at the front table and say, ah, but that was good because that also was an incentive to get to work eventually, to figure out how to carve out the time to dedicate myself to make sure it happened because otherwise I was going to be miserable every time I went to a bookstore for the rest of my life. Do you think you would have embarked on this second career if your first book hadn't been a success or if your second book hadn't been a success? If they weren't as well received critically, but if they hadn't sold as well as they did, would you have done this? Could you have done this? Would you have just kept writing books and that would have made you happy? Yeah, I wouldn't have quit my day job necessarily. But at that point, I remember finishing Rules of Civility and feeling like I don't know in the way we were talking a second ago, I don't know if it's going to be popular, I don't know if it's going to sell, but this is what I wanted to do. I feel very happy with the book, how it's written, how it holds together of the challenges that I've overcome to make it. And I thought, yeah, this is good. Even if that book did not sell, it was a great sort of renewal of confidence that I had as a younger person of, yeah, I can do this. And that I would have gone on and on. I would have written books that nobody read until I died, I think quite happily, not as happily as if it were read. But there's this sort of in the arts, this sort of a mystery of, there is sort of an element of you feel like it's a gift. And every time you sit down to do it, you're not sure you're going to be able to summon the magic because there is a certain magic in the process of writing where your subconscious takes over, your unconscious takes over, and where you surprise yourself and where the perfect word lands, comes to you just at the right time. And the character does something that you don't anticipate, but it's beautiful and the fitting. And that's sort of the gift aspect of it. Over time, you sort of gain confidence. I think this is going to be there again if I sit down and do the work. But still, again, that's a pleasant surprise to have it show up. And so I think I would keep pursuing that no matter what. Maybe when it comes to novels, you have all these elements, you have plot, character, syntax, structure, pacing. Over these three books, what do you think is the one thing that you can feel yourself getting better at? I could add eight elements of craft to your list. Sure, of course. Because you're right. Because there's 15, 20 significant elements of craft that go into the building of a novel right down to the semantic ones, whether metaphor, illusion, allegory, simile. And I think I improve in all of those categories to some degree. And I know part of the reason I say that is that for those who know my work, you know that the three books are very different. And that's something that I like to do. I like to, when I finish Rules of Civility, to give myself a very different task. Tell a very different story with a different structure, with a different tone. And I do that because it requires me to reinvent every aspect of the craft. Because the story of the gentleman in Moscow, this sophisticated aristocrat born in the 19th century in Russia, versus the young men in the Lincoln Highway in the 50s in the United States, these 18 year olds from the Midwest and from the inner New York City, to write those two different books, you have to use a different vocabulary. You have to use a different kind of pacing. The stories are one is a 10 day story, one is a 30 year story. Structurally, that's a very significant difference. Thematically, obviously, it's very different. Tonally, point of view is very different. And so because of that, the reason I like that, I call it Shifting Gears, is that it forces me to revisit how do you do dialogue? How do you do structure? How do you do setting? How do you bring a voice to life in the way that serves this tale? And it's not a linear progression of increasing mastery. It is more that we've gone back into this element of craft and we've learned a whole new sort of set of skills, hopefully, through bringing this story to life in this way. To jump back to mystery novels, again, in your By the Book interview from a few years ago, you said, quote, during the summer, we're in summer now, I like to read crime and suspense novels by individual authors in chronological order. And I am a person that loves a project. I love moving through film directors, authors, what have you, in order, trying to really take in the totality of their oeuvre. I'd love to hear some authors that you've done this with in the past. And then who are you working on the summer? Yeah. And I started with some of the, I went back and read all the Agatha Christie. Maybe that's what got me started on the project, just for the fun of it. Because I'm reading literature all fall, winter, spring. And in the summer, it's nice to have this different type of reading that I'm doing. But I read all of Hammett from beginning to end, and then I read Chandler from beginning to end, and then I read Ross McDonald from beginning to end, who we were just discussing earlier. And I loved doing that. And one of the great things about them is that they're all operating in California. Obviously, Hammett's writing about San Francisco, but Chandler's really writing predominantly about Los Angeles in the 30s into the 40s, into the early 50s. Ross McDonald is going from the 50s into the 60s, and so you're following murder in Los Angeles decade by decade. And eventually you can work your way up to Michael Connolly and just do this whole Los Angeles thread. It's great, it's a great pleasure. Great discovery for me, which was last summer and what's spilled into this summer is George Simenon, which I had never read. The creator of Inspector McGreit, however you pronounce it. And a Belgian, very prolific Belgian mystery writer. Very prolific, and so part of the reason it took me more than a summer is I think I've now read 40 or 50 of his mysteries. I looked this up before, he has 75 in this series. And Penguin's been reprinting them, and Faulkner was a fan, Andre Gide was a fan, and you can see why in reading, and I think Faulkner is the one who compares him to Chekhov, and you can see, you can totally see why in reading it, because they're very spare in this beautiful way, the detective is this terrific character who's just genuinely observant and interested in people. And so one of the great pleasures of his mysteries is that he'll come into a cafe and he's just observing what's going on around him. The mystery hasn't even begun yet. And what you slowly realize is that's how he's going to solve things, because he, just by watching how the waiter brings the cup of coffee to him, he can tell that he's in a bad mood, his wife is probably leaving him, and he's dying to quit his job. There's a violin in the corner, it's probably his. So at all times, he's thinking and unpacking what he witnesses in daily life. And as I say, that's the overlap with the Chekhov, where you have this sort of very spare beautifully written sentences, which are talking about very simple aspects of the mechanics of daily life, but behind them are these layered stories of the individual lives. And so that was a great, that's been a great pleasure. I loved doing the George Smiley books. So Les Carre, of course, is an amazing writer. I think he probably is, he's not a great suspense writer. He is, he's one of the greatest post-war novelists writing in English across the board. And if you follow the George Smiley thread, it's terrific because sometimes he's a central character. Sometimes he's an agent of, for somebody else who's central to the story. But in that development, you know, Spy Who Came In From The Cold, I don't even think it's 200 pages. And as he's getting older and more intricate in his approach to his own writing, the books are becoming increasingly challenging and demanding and larger. Tinker Tailor Soldier Spy and The Honorable Schoolboy are these incredible sprawling books. And one of the great pleasures, of course, of his work is that the spy craft is excellent, but he's really interested in individual personalities and he's interested in institutional behavior. And he's constantly unpacking how does the various institutions involved create the circumstances which result in an individual's death and putting the world at risk and putting two countries against each other is very often the way in which the quotidian aspects of institutional behavior. We stamp this, we staple that, we file that, and as a result, we have these outcomes, which could be terrible, or they could be the investigation itself. And you have alighted this summer also on someone that I am reading. I started reading him after watching the Apple TV series, and I can't wait to get through as many of his books as possible. Who is that? What is this book I'm looking at? It was the same thing for me as Mick Heron. And what is being discussed here, of course, is Slow Horses, which is the Apple series starring Gary Oldman. And the setup really is that Slow House is a crummy building where MI6 sends all of the agents who screw up royally. And you're not going to get fired. They put you there and they wear you down through humiliation and through having nothing to do and through condescension until you quit, you give up. This is this house of misfit spies and practitioners of craft. At the head of it is a character named Jackson Lamb, who was clearly a great spy during the Golden Age of English MI6, you know, against the Cold War, dating back to the Second World War and doing the classic Eastern Europeans type stuff and behind the lines, you know, operating in Russia. And so he's a true spy, but he's gotten old. He doesn't carry more. He doesn't respect his bosses. And so he loves running this group of misfits because he's constantly telling them how stupid they are. But in the series, inevitably, a major spy problem lands at their feet by mistake and suddenly they're in operation. And the series, Slow Horses, is great with Gary Oldman playing this main figure. But it was eye opening. My wife, me, our friends were like, what is this series? And it turns out my wife really did the work on this. It turns out there's a whole series of novels, I think it's 10 maybe so far. And she, as my Christmas gift, tracked down all of them and they landed, you know, on a big box for me for Christmas Day. So that's what I've been working through this summer is working my way through the Slow Horses series. It's an excellent project. I want to join you on that. As we close out, I just want to talk about your next book, which I know you're working on. It's called Table for Two. Well, that's done. I'm glad to say so in April, I will have a collection coming out, which has six long stories about New York in it. But then it has a basically a 200 page novella. And that 200 page piece is called Even Hollywood. And I finished Rules of Civility, there was a character who was a great troublemaker and very sort of charismatic named Eve, who was Katie's roommate, who in the middle or late in the novel just goes to Hollywood in 1938 without telling anybody and disappears into Hollywood. After that, when that book came out, I went back and wrote six shorter stories about what happened to her in Hollywood when she arrived in 38. But they didn't complete the story for me. They continue to imagine and wonder and be interested in curious about what happened to her, even if I extended that time horizon a little bit. So I went back, took those stories and I expanded that into a 200 page novella, which is still called Even Hollywood. And that is a New Irish piece in which there is absolutely murder and blackmail and it's a lot of fun. But so you have the six New York stories and you have Even Hollywood as a part of this collection called Table for Two, and that would come out in April. And I'm at work at my next novel, but that'll be take a couple of years. And you're not talking about your new novel, I assume? I can only tell you that it begins in Cairo at the end of the Second World War and it ends up in New York City in 1999. But that's all I'll say. That sounds pretty sprawling. It is. Your short stories that are set in New York, are they contemporary? Yeah, because it's a good question because all my novels have not been set really in the contemporary world. But five of the six New York stories are really set around the year 2000. So they're very contemporary. Can I end this interview by giving you a wacky fact? Yes. I listened to another book podcast that's called Backlisted for listeners and for you, Amor. It's a great podcast out of England that's run for many years in which they talk about old books that bring on two or three people. And they did an episode on the Maltese Falcon and they kept pronouncing Hammett's first name Deschile. And I was like, what the hell are you talking about? And eventually they address it halfway through the episode where they say they found a YouTube clip in which Lillian Hellman, the American playwright that was Hammett's long term partner, says that the way that you pronounce his name, the way that they pronounce it where he grew up in Maryland or whatever, was Deschile, not Dashill. Now, whether or not she was taking the Mickey, who knows? Yes. I don't expect anyone to ever pronounce it that way, but it fascinated me that we've gone all of our lives saying it this way when it actually was this way. That is terrific. I love knowing that. We'll just call him Dash. Let's make it easy, right? Dash Hammett. Amor Toles, thank you so much for coming on the Book Review Podcast. Gilbert, thanks for having me. We'll be right back. Hello everyone. I'm Sarah Lyle from the New York Times and I'm joined by the British actor Richard E. Grant, the author of a new memoir, A Pocketful of Happiness. You may know him from his work on film and television, starting with his cult classic role in the film With Nail and I, in which he played a drunken, impacunious, out of work actor. In 2019, he was nominated for an Academy Award for his portrayal of the drunken, impacunious, out of work friend of Melissa McCarthy in the film Can You Ever Forgive Me? His new memoir, A Pocketful of Happiness, was published this summer in the aftermath of the death of his beloved wife, the dialect coach Joan Washington from lung cancer. Written in the form of diary entries, the book looks back on their nearly 40 year relationship and the terrible months of her illness. It also mentions a lot of famous people, Steve Martin, Nigella Lawson, Adele, Emma Thompson, the King of England. It's honest and brave and befitting its author, kind-hearted and funny. We're going to talk about that for a few minutes and then move on to a book Richard loves and has read many times throughout his life, Alice's Adventures in Wonderland. Welcome. So let's talk about this wonderful book, which is really life-affirming, even though its subject is so sad. It's called A Pocketful of Happiness. Where does the title come from? Four days before my wife Joan died in the beginning of September 2021, 23 months ago, she said to my daughter and I, I know you're both going to be sad, but I challenge you both to try and find a pocketful of happiness in each day. At the time I instinctively thought, oh, it sounds like a kind of hallmark card, something that was trite and didn't really have, I didn't really think about it particularly at that point of time. But the wisdom of that has been extraordinary because it's been a mantra by which my daughter and I have really navigated the abyss of grief that we've had to deal with in the last 23 months. And what it has built into it is permission to feel joy and happiness despite the fact that she is no longer here to share it with us. One of the things that's so lovely about the book is that the joy you two have in each other emanates from the pages. It's just so wonderful to read about your relationship. Starting from its beginning, you met in 1982 and you were a very thin young man who'd newly arrived to London from Swaziland, which is now called Eswatini, which I have to say I'd never heard of before I read this book. It's near South Africa, right? It's near Botswana and South Africa, Eswatini? It's between Mozambique and South Africa. And it's the smallest country in the Southern Hemisphere. So that is why nobody's ever heard of it. And you met because you were consulting her about accent coaching, hoping to get a role for a film set in Northern Ireland. Did you have a Swazi accent at the time? The first audition that I went up for when I was working as a waiter as an out of work actor in London, various directors said to me, you speak English like somebody from the 1950s. And I suppose because Swaziland was in the colonial society that I grew up in was in a time warp. I'd never noticed that before. So that is how I came to ask who would be my future partner for life, Joan Washington, if she would give me private classes to make me sound like somebody who was speaking English in London in 1980s rather than in the 1950s. So I didn't get the Irish job, but I got a wife. What was it you describe in the book, what it was like when you first met? Could you talk about that a little bit? She had very short cropped hair in the style of Laurie Anderson, who had a big hit that year with Oh Superman, an unlikely hit. And she was in a boiler suit with a big belt and kicker boots and an absolutely take no prisoners Scottish Calvinist attitude. And so when I said to her, would you give me private lessons? And she said, but what for? And I said to fix my colonial sounds. And she said, well, you sound all right to me. And I said, OK, well, I'll give you a couple of lessons. I charge you 20 pounds per hour at that time is about $40. And I said, oh, I can't possibly afford that because I'm living in a bed city, not in your gate. And I'm a waiter. And she said, well, what can you afford? And I said, 12 pounds. And she like a dumb deal on the provisor that if you ever make it as an actor, you have to repay me. So on our first wedding anniversary in 1987, because paper is the gift of the first anniversary, I gave her an envelope stuffed with 50 pound notes worth about $2,000. So I said, I think I've repaid my debt. What a great anniversary. The book really goes from joy to sadness very quickly and then shifts back and forth a lot. There's so many ups and downs that year when your wife was ill. You talk about being sucker punched by a tidal wave of grief. And then you're overwhelmed by the love and support from your friends and your daughter and also by the chance to have this final time with Joan. Some days she's positive and chatty and wonderful. And other days she's quite difficult and non-communicative. When you look back on that year and all those conflicting emotions, can you talk about what the hardest part of negotiating those ups and downs was? It's the wonderful trick of memory, which is why I was so determined to keep a forensically detailed diary of whatever time we did have left so that I wouldn't, as I am now, 23 months later, not really remembering any of the real horrors that you have to deal with when somebody is terminally ill. And the worst being that they know that they're never going to get better. And each day and each week that goes by, as it incrementally deteriorates, they are denied hope. And hope is the thing that bores us all along because you always think, well, no matter how bad some circumstances, there's always hope that you're going to get out of it. Was your term nil? You don't have that choice. So she really guided my daughter and I extraordinarily because she said, I've had my life. I've met everybody that I wanted to. I've been everywhere that I was curious to visit. And it's my turn. And she said, painful as it is for you to take on board, every single one of us, including both of you, my daughter and I are going to die. And it just happens to be my number is up. So I think because she was so sanguine and clear eyed about it, it really helped us to guide our way through. But then of course, nothing prepares you, even though we had eight months of the last eight months of our life together every minute of the day, even though it's coming, nothing prepares you for the absence of that after being together for almost 40 years. So, well, grief is such a nonlinear thing, isn't it? And there's so many different periods of it when someone dies because there's the immediate shock of it. And then there's the what may be worse, the day to day life of living without someone. And you describe your relationship as a never ending conversation that you just talk, talk, talk the whole time. But I think that we have relationships with people who are gone. I think we continue that conversation. I think it's just a different kind of relationship. It's not like she's not in your life anymore. And it feels to me that writing this book in some ways is a way to keep her alive. And I wonder if you feel that. Do you still talk to her? I do. What I do is because when you are bereaved, you only hear your own footsteps in your wherever you're living. And that is the that's the big shock. But what I got my head around was thinking, well, I know after almost 40 years together, what her response to almost everything would be. And I've now got in the habit of writing to her every day as though she's still here and telling you about my day. And you know, even knowing that I won't get a response, I feel somehow that that's as close as I can get. It feels like sometimes the response is a very quiet one, but it's there. It brings someone very close to you to keep talking to them like that. And I feel it keeps someone alive. I really do. In the middle of all that, the book is full of unexpected moments when the reader just goes, Oh, my God, this is such an incredible detail. And one of those, it's a little bit of a throwaway, although you talk about this subject a bit more in the book. But when you mentioned you just happened to mention a statue you had commissioned in your back garden, and I wrote on my margin, what can you tell us about this particular statue? And what I wish I could, I wish there was a video that we could show the audio listeners so I could see a picture of this statue. Well, if they go online and they put my name in there and they put Barbara Streisand, Richard E. Grant statue, it'll pop up instantaneously. I have been an obsessive fan of Barbara Streisand since I was 12 years old in 1969. And I saw her first in a movie called Funny Girl. And I've subsequently met her multiple times. And the last one to one face to face, nobody else interrupting hour and a half conversation I had with her, Donna Cannons has in the Hamptons four years ago, I still can't believe I'm saying the sentence to you. I said to her to have something to confess. And she said, What's that? And I said, I commissioned a sculptor to make a two foot tall statue of your sculpture of your head. And she said, You are crazy. And I said, Yeah, I know that. And she said, No, no, no, you are crazy. So she knows about it. And she's seen the photograph. So she hasn't seen it in the flesh as it were. Richard, why just her head? Because if I think of somebody in a movie, I think of their head. I never think of them as a whole body. Because when you see somebody in close up in a movie, that's what you see. So it's like a bus. And does it look like her? Can you tell it's it's Barbara Streisand? Everybody that knows her anybody that's coming to my yard and my garden, whatever you call it, they said, Oh, my goodness, that's Barbara Streisand. So Melissa McCarthy took a picture of me when she came out for dinner, standing either side of the statue. And then and then she she put on Instagram that we were a struggle because they've she recorded a duet with her on her uncle's album some years ago and knows her. And she said, it's absolutely there's a sculpture of her. Absolutely. That's so wonderful. There's another great moment in the book, which is it's a name dropping moment, but it's so perfect because it tells you so much about Joan. And so could you tell us about the visit of King Charles to your house? Well, he was Prince Charles at that point. He hadn't been crowned yet, but his secretary called me up and said Prince Charles would like to come and see Joan because he knew that the end was very, very nigh. And he was about to go away to Scotland. And he said, and she said, could he come around on Sunday? I said, I can't because we've got a whole bunch of people come around for lunch. And I wouldn't wouldn't like that. And then she called back and she said, could he come around this afternoon? I said, yes, of course. So he came around and drove himself and came to a cottage that we have in the Colts, where we were living at this point, and brought her a bag of mangoes, which he knew were her favorite fruit and freshly cut highly scented roses from Highgrove is his state, which is 10 minutes away from where we live. And then he sat with her for the good half hour, held her hand and said, his opening gambit was it's been an absolute honor and pleasure to have known you, Joan. Which she, quick as a whip, she just said straight back to him, I'm still here, which broke the ice. And they talked very philosophically about everything. And he knew exactly what because she was so exhausted by this point, that half an hour was as much as she could really take. And she was very touched by that and buoyed up by his support. So it was very touching that he took the time and somebody as busy as he is to do so. I think there's a great gift that people can give when they're that ill and by no means do you have to do it. It's not your job. But it sounds like she sort of took on the job with your friends and certainly with you and your daughter of trying to make it easier for you. And joking with Prince Charles was one way to do it. But another way was just to give people the grace of her time and attention and letting them say their goodbyes, which is hard. The other thing that I should add in here is that she treated absolutely everybody because she was completely unstarstruck unlike me, perennially starstruck or permanently starstruck. She treated Prince or pauper in exactly the same way. And I know that for now King Charles that he was always very appreciative and grateful that she wasn't sycophantic or put on airs and graces at all. She just said it like it was. And I think if you're in a situation where if your royalty or a really famous movie star, which she worked with many, being surrounded by yes people or somebody who's going to tell it to you straight, she absolutely did that with great kindness and honesty and flinching accuracy. There was no escape. Well, she comes so vividly alive in this book and it's really a pleasure to get to know her through your pages. One thing that also comes out in this book and in your discussions with her or talking about her or just your accounts of things that have happened to you is your deep appreciation for the surreal and the absurd. Many of your film and TV roles, it's clear you get the joke. I mean, you did cocaine on girls with the cast of girls. And that brings us to the book that you've mentioned that you would like to talk about. And I'm so thrilled to talk about it because it's a book I read a lot as a child as well. It's one of the great examples of absurdist literature. It's Alice's Adventures in Wonderland. And you said that you've read it over and over again in your life. And I wonder, I mean, I'm sure most of our listeners know it a bit, but could you very quickly describe the book to us? I have read it first when I was six years old and I've read it every year ever since and I'm now 66. So that is at least 59 readings of this book. It's about a younger called Alice Little, who is sitting beside a river with her sister hearing a story being read to them. And she sees a white rabbit run past and go down a rabbit hole and she follows him and goes down there and goes on this extraordinary adventure and meets the most exotic and eccentric cast of characters. And then of course, at the end, you discover that it's all a dream that she had just fallen asleep. But I think it's the best guide, unofficial guide to the English class system, sense of humor, attitude to authority of any book or manual that I've ever come across. It is a work of genius. There's a lot to talk about from what you just said. You read it when you were six. Can you tell us where you were, how you got the book? Did you read it yourself? Did a parent read it to you? My parents read it to me and I was six years old living in what was then the kingdom of Swaziland in Southeast Africa. And I also had a vinyl record of it that I played on a little windup recorder. Tell you how ancient I am. And it's had this extraordinary English artist called Joan Greenwood doing the voice of Alice, who's just very sort of throaty and very unusual. And Stanley Holloway played the Mad Hatter and he was famous for playing Alfred Doolittle in My Fair Lady. So my parents had that record as well. So I knew him from that. And hearing this story played endlessly on a record player that I could put on anytime and having it read by my parents, the record player won hands down because all the voices were of brilliantly trained actors who embodied all these extraordinary characters. Do you remember when the first time you actually read it on your own with no parent, nobody around was? Oh yeah, absolutely properly when I was seven years old. I didn't understand all the words, but I learned to read because there was no television when I grew up in Swaziland. So listening to the radio or what we used to call it then as the wireless BBC World Service, that was the only outlet from where I lived for anything beyond the borders of where I grew up. So reading was the conduit to that. And I've been a lifelong bookworm ever since as a result. So I learned to read very quickly and very fast. What was it about the book that struck you when you were a little boy? What did you like about it? Well, of course, identified completely with Alice because she is very well behaved, very well brought up. And then she's plunged into this world where nothing really makes sense. And all the adults seem completely bonkers and the mad hatter at the tea party, the doormouse, the queen of hearts is always saying cut off their heads or imprison them without even giving them a trial. And of course, by the end of the story, she recognizes that they're just a pack of cards and the queens have no consequence. Reminding me of what Napoleon said about a throne, that it's just a chair covered with some velvet. So there's a kind of innate anti-authoritarian, you know, cocking a snoot at this adult world of all these rules that people make up, which you feel as a child that you think, well, who made up these rules of how you're supposed to eat or when you're supposed to talk or how you're supposed to sit or dress? You're powerless. So I think that that's instinctively you identify with as a child and it has a kind of innate anarchic spirit to it. And it's also hilariously funny. And Alice is a great sort of voyeur of all this stuff. She's in the story, but sort of apart from it, isn't she? And one of the things I was struck by when I went back and read it again yesterday, so exciting to come back to it after all these years, I have to say, was how much of the book she spends saying, I'm not really sure who I am. I can't quite remember. I'm not sure I'm supposed to be this height or that height. It's sort of odd. And I wonder if that speaks to childhood a bit too, this notion of not being sure yet who one is. Sarah, I think it speaks to you no matter what age you are. When the caterpillar says, who are you? I ask myself on a daily basis, I'm 66 years old. Who are you? What does it all mean? Is it all just a pack of cards? These things that become phantom and so enormous and seem so frightening or overwhelming sometimes you think, well, who are you? And what I love as well is that Mad Hatter and White Rabbit, curiouser and curiouser, I have been labeled hyper curious ever since I can remember. So I've always been told you ask too many questions. I think, well, again, who's made the rule to say you can't ask all these questions? How do you find out about people or the world if you don't ask questions? And they say, well, you're overstepping the mark. You're oversharing. It's not etiquette. So it's Alice all over again. Are there any other books that you've read this often or is this the one that you've sort of said, this is what I do every year. I'm going to read this for a particular reason. It's the one every year. And I think that more than anything, it's like the talisman of your childhood, that it is the feeling of reading it and either hearing the recording of it or just starting the story all over again, takes you back to all the different phases of your life and moments you have read it. So and it's very difficult to go back in time to your childhood, but that one absolutely just plugs me straight back in there. I think you're absolutely right about that. And I wonder though, as you have gotten older, do you read it a different way? Do you see different things now at the age of 66 that you did at the age of six, 60 years ago? That's a long time ago. I know you absolutely do. But having said that, whatever wisdom you think you've accrued over these six decades, by the same token, I still think, well, when am I going to be? When will I know who I am? When will I be a grownup? When will I fit all these things that you're supposed to fit into? I'm wondering if there's a time of year that you normally read this book or do you just read it any time during the year? I will probably read it on the night that I put up my Christmas tree, which is always the first of December. So the combination of Christmas tree and the holiday season coming and all of the childhood memories that that provokes go hand in hand in tandem with reading Alice in Wonderland. And I've also got tree decorations that are Alice in Wonderland figures. So that's a good combo. That's so wonderful. Thank you so much for your time. This was absolutely wonderful. It was great to talk to you. Thank you, Sarah, so much. Thank you very much. That was my conversation about mystery novels with bestselling author Amor Tolles, followed by Sarah Lyell's delightful and moving conversation with Richard E. Grant about his new memoir, as well as the book he has read the most in his life, Lewis Carroll's Alice's Adventures in Wonderland. As I said, we're going to take a few weeks off here and we'll see you after Labor Day. I hope you find some time to catch up on your reading. I'm Gilbert Cruz, editor of the New York Times Book Review. Thank you for listening."}, "podcast_summary": "In the Book Review Podcast, Gilbert Cruz speaks with bestselling author Amor Toles about his recent piece in the Book Review's thriller issue. Toles discusses his love for mystery and suspense literature and his role in editing a collection of mystery stories. He also delves into the changing role of the cadaver in crime novels throughout history. After the break, Sarah Lyle interviews actor Richard E. Grant about his new memoir, \"A Pocketful of Happiness,\" in which he reflects on his nearly 40-year relationship with his late wife and their experiences during her illness. Grant also shares his love for \"Alice's Adventures in Wonderland\" by Lewis Carroll, a book he has read many times and discusses the book's themes of anti-authoritarianism and humor.", "podcast_guest": 